{
  "changelogs": [
    {
      "id": "1357428075155165204",
      "content": "```\n- Re-Enabled Global Buffs\n- Various backend performance improvements (@Akk)\n- Zebuxoruk now drops minimum of Enchanted quality augments, and can rarely drop additional augments.\n- Lord Inquisitor Seru has a higher probability of dropping additional loot based on the number of difficulty-enhancing buffs present on him\n```",
      "author": "catapultam_habeo",
      "timestamp": "2025-04-03T18:54:32.911000+00:00"
    },
    {
      "id": "1357226963760316516",
      "content": "Late Night Hotfix\n```\n\n- Temporarily disabled global buffs through Apocrypha and the event Signets (Manually extended for 24hrs!)\n\n* Needs new Zone Server (Probably won't work in Bazaar, will be more reliabile as zones cycle out) *\n- #commands will be consumed in any channel (the spam should go down)\n- attackmode ranged should be less laggy and more reliable for displaying weapons correctly\n\n* Needs CLIENT UPDATE (PATCH) *\n- Added the following command aliases\n  /pet (#petcmd)\n  /attackmode (#attackmode)\n  /autoskill (#autoskill)\n- #commands should no longer echo in chat (even if nobody could see them when properly consumed)\n```",
      "author": "catapultam_habeo",
      "timestamp": "2025-04-03T05:35:24.218000+00:00"
    },
    {
      "id": "1356802123106357349",
      "content": "4/2/2025 (Yes, this one is real)\n```\n- Reverted class deletions. Implemented <<# a u t o s k i l l>> instead\n  - Initially supports the following Skill attacks\n      Backstab\n      Bash\n      Tiger Claw\n      Eagle Strike\n      Dragon Punch / Tail Rake\n      Flying Kick\n      Round Kick\n      Kick\n      Frenzy\n  - Absolutely no timer deconfliction is executed by the command, please only enable skills you want to be used.\n\n- Implemented #attackmode\n  - Rangers no longer display their bow by default. Any character can use #attackmode ranged to preferentially use their bow for autoattack and display\n\n- Implemented #petcmd\n  - Pet window buttons (and hotkeys created from them, or /pet commands) only send instructions to the 'active pet' (the pet displayed in the window)\n  - 'Triple-pet' UI mod is not recommended, as it may be confusing as to which pet is 'active'\n  - added #petcmd to send instructions to ANY pets (send commands by class name, etc)\n  - Usage: #petcmd [attack, qattack, follow, guard, sit, stop, taunt (on\\\\off), hold (on\\\\off), ghold (on\\\\off), spellhold (on\\\\off), focus (on\\\\off), back, regroup (on\\\\off)] [all, mag, bst, nec, enc, shm, dru, brd, shd].\n  - Any number of command and target verbs may be used at the same time, and in any order\n  - /pet health and #petcmd health now display inventory for that pet\n\n- Removed access to #mystats. On most servers, the inventory\\player profile page is inaccurate and so mystats is needed. On this one, due to the unique nature of our technology, the inverse is true.\n\n- Corrected bug which allowed creation of augmented items that were not usable in any slots.\n- Syncrosatchels or equivalents will now consider slotted augments to determine which slot an item can be equipped into\n- Splinters of Time which are not PRI\\SEC\\RANGE no longer require slotting into a weapon\n- Dispel-type spells cast by players on players or player pets are no longer resistable.\n- Dispel-type spells cast by mobs are now resistable.\n- Fixed Monk class names display on Character Select\n- Sol Ro Tower respawn timers have been fixed.\n- Legends of Norrath cards no longer have a self consume clicky effect and have an updated lore.\n- Innoruuk and Rallos Zeks adds no longer leash and assist their god\n- Aid Grimmel quest npc should be more responsive now.\n- The rztwl event in plane of tactics should behave even more as expected, with failure timers removed.\n- The Fennin event in plane of fire should now correctly resume when returning to the zone and no longer fails on timeout.\n- Plane of Earth a ring events rewritten to be more resilient to zoning out. (Thanks Pippz)\n- Echo added to Splitpaw\n- Mortal Coil is no longer blocked by random clickies\n- Villagers in HoHA are now tethered and will not run full marathons.\n- 61-65 LDoN spells have been added to PoP parchment turn in rewards\n- 50-60 LDoN spells have been added to Warders, Ancients, Lords and Ladies in Velious\n- Mistakenly remaining GoD and OoW spells have been removed from PoK vendors *and* player spellbooks.\n- Lvl 62 BST and lvl 63 Necro pet now correctly scale their level.\n- The likelihood of finding weapon augments has increased on the Glamour NPC.\n- Aspect of the Reptile duration has been increased.\n- /shield now works for Warriors level 30 or greater\n- All entities are capped at 35 worn Shielding\n- Switched Prismatic Strike to Chromatic resist type\n```",
      "author": "catapultam_habeo",
      "timestamp": "2025-04-02T01:27:14.313000+00:00"
    },
    {
      "id": "1356635539750650037",
      "content": "```\n- Implemented the new Player Rendering Overhaul!\nThis feature, unique to THJ, will provide an unparalleled graphics experience like you have never seen before! Enjoy AAA quality which you had never imagined that you'd see in this game. Please note that this is a REQUIRED feature, and out of date clients will be disconnected automatically, so please remember to patch!\n\n- Nerfed Mnk/Mnk/Mnk\n- Removed several redundant player classes; Monks, Rogue, Warrior, Wizard, Berserker are all classes who's roles are better performed by other classes, and so these have been permanently disabled.\n- Bard has been removed because it is just too much trouble and causes too many bugs.\n```",
      "author": "catapultam_habeo",
      "timestamp": "2025-04-01T14:25:17.746000+00:00"
    },
    {
      "id": "1354667173997449316",
      "content": "```\n- Removed level requirement from the Plane of Time.\n- Exp gain from level 63 to 65 has been increased.\n- Pet level adjusted for BST/NEC/ENC pets using Time focus.\n- Respawn time in Plane of Tactics and Plane of Water have been reduced to match other respawn times.\n- Pheonixs in Plane of Fire no longer charm (and/or crash your game).\n- Echo added to Tenebrous Mountains.\n- Echo added to Dalnir's Crypt.\n- Aid Grimel should now be able to be completed.\n- Added 2nd Type 4 augment slot to Bows\n- Augments currently Slotable in type 1 & 2 are now also slotable in type 4.\n- Plane of Time - Phase 4 and later bosses should no longer double-spawn\n- NUMEROUS Plane of Time fixes and adjustments to bring events more in-line to expectations\n- Reworked Plane of Earth ring events\n- Askr no longer despawns in Non-Respawning instances\n- Trial of Torture now properly granting flags\n\n- The approximately one thousand characters who achieved level 65 prior to this patch will recieve the title 'of the One Thousand'\n```",
      "author": "catapultam_habeo",
      "timestamp": "2025-03-27T04:03:42.780000+00:00"
    },
    {
      "id": "1352847240527609957",
      "content": "Running changelog for Post-PoP hotfixes.\n```\n- Corrected flagging logic for Aerin`Dar event.\n- Corrected flagging logic for Grummus event\n- Corrected flagging logic for Hedge event\n- Corrected goup port logic for PoJ trials (@Gregggggg)\n- Corrected group port logic for Keeper of Souls (@Greggggg)\n\n- Fixed zone crash related to tradeskills\n- Fixed inability to mix enchanted\\legendary in standard tradeskill combines\n```",
      "author": "catapultam_habeo",
      "timestamp": "2025-03-22T03:31:56.828000+00:00"
    },
    {
      "id": "1352780161384317089",
      "content": "Part 2\n```\n*** KNOWN ISSUES ***\n- The Plane of Time expedition does not currently recover cleanly from being fully shut down during PHASE 3. Please complete Phase 3 before leaving the zone for any extended period of time.\n\nMisc\n - Removed all spells and disciplines from vendors which are otherwise obtainable from quests in PoP.\n - Celestial Fists are now Must-Equip to click (Reminder, Must-Equip can click from inventory once attuned)\n - Mobs should no longer restore from saved state with 0 hp\n - Mobs should no longer slowly levitate into the air as zone is suspended and reloaded\n - Adjusted several PoP ZEMs\n - Nerfed Mnk/Mnk/Mnk\n - Added PoK book to Bazaar\n - Added many new Enchanted\\Legendary items, should have full coverage now.\n - Valentine's Day buffs have come to an end!\n\nPOP Events\n - Planes of Power progression flags are *account wide*\n - Check the Storyline window for a flagging guide!\n - HoHA - Crazed Norrathians now have a one minute timer before spawning in each room. (Pippz)\n - Agnarr - Stun duration cut in half. 15s Recast Added.\n - Tallon Zek PoTactics - Knockback distance cut in half. Proc chance reduced to 20%.\n - Hebabbilys the Ragelord - Max damage and slow mitigation reduced.\n - High Councilman of the Queen - No longer have a chance to softblur every 6 seconds.\n - PoAir - Wave of White Noise now correctly has a 45 second recast.\n - Wind of Xegony is now a magic debuff instead of a curse as it should be.\n - The Rathe Councilmen are no longer immune to CC.\n - Trash in Time P3 is now susceptible to some form of CC or kiting.\n - Rallos Zek's stun reduced to 4sec duration.\n - Quarm is no longer slowable.\n - Vallon Zek no longer FDs his target and instead stuns and swaps targets.\n - Rallos Zek and Innoruuk should no longer be able to be separated from their adds.\n\nQuests\n - Fused Mnemonic of Khati Sha is now completable.\n - Increased stats of Signet of the Arcane\n```",
      "author": "catapultam_habeo",
      "timestamp": "2025-03-21T23:05:23.914000+00:00"
    },
    {
      "id": "1352780052215107604",
      "content": "Part 1\n```\nAugmentations\n  - Reworked Augment slot schema\n   - All Visible Slot (head\\arms\\chest\\legs\\feet\\wrist) have a Type 21 (Armor Glamour) slot\n   - All Weapon\\Shield Slot (Pri\\Sec\\Range) have a Type 20 (Weapon Glamour) slot\n   - All items EXCEPT pri\\sec\\range\\charm\\ammo have Type 1 slot\n   - All items EXCEPT charm\\ammo have Type 2 slot\n   - All pri\\sec\\range have Type 2 and Type 4 slots (2 total slots)\n   - All 2-handed primary have extra Type 2, Type 4 slots (4 total slots)\n  - Removed LORE from Kerafyrm augments\n  - All LEGENDARY augments are now ATTUNABLE, and will attune when slotted\n  - Renamed all Glamour-Stones to `Glamour - 'Item Name'\n  - It is now possible to create augmented items which are both NO TRADE and unusable by you.\n\nBazaar\n - Purveyor of Glamour will now randomly reward Weapon or Armor Glamours when asked to provide a random Glamour.\n - Purveyor of Glamour will now accept 4 Glamour augments to produce a new random Glamour\n - The 'Prestiege' Bazaar search paramter has been replaced with 'Glamour' and can be used include or exclude those items from search.\n - Vision of Ayonae will reset AAs for 5 EoM (down from 10), and no longer imposes a cooldown.\n - Vision of Ayonae will refund all now-unusable AA when removing a class.\n\nSpells\n - Dispel can now be cast on other players without redirection by implied targeting.\n - Dispel cast by a player on a player or player's pet can no longer remove beneficial effects.\n - Dispel cast by a player on a player or player's pet can no longer remove any effects with counters (poison, disease, curse, etc)\n - Melee damage no longer interrupts casted direct healing spells. (Movement, stun, silence, etc, still can)\n - Calliav line is now instant-cast\n - Removed scaling of Bard rune songs via Heal Amount.\n - Bard rune songs are no longer expended via damage, instead offering a flat damage reduction.\n - All single-target DoT spells and songs have had their cast times reduced to 1 second, the amount removed from their cast time added to recast time.\n - All single-target DoT spells with a base duration greater than 30 seconds have had their durations doubled.\n - All single-target DoT songs have had their duration increased to 1 minute.\n - NEW SPELL: Aspect of the Reptile (DRU 60)\n\nDisciplines\n - Puretone discipline now stacks with all other bard mods\n - Puretone discipline now additionally grants immunity to silence for the duration\n\nAA\n - The following AA always stacks with all other effects: Rabid Bear, Union of Spirits, Ancestral Aid, Guardian of the Forest, Hunter's Fury, Killing Spree, Spirit of the Black Wolf, Spirit of the White Wolf\n\nPets\n - Substantially reduced direct mitigation bonuses from pet buffs.\n - Added Greater Syncrosatchels for Necromancer, Enchanter, Beastlord; Available from Merchant Aina at level 60\n - Pets are no longer valid targets for NPC Rampage while they have taunt off\n - Sympathetic (Healing) will no longer affect all pets when triggered by a pet-only spell, and will instead behave similarly to sympathetic buffs with other AoE spells (It will hit your current target or implied target when cast).\n - Reworked aggro sharing with pets; pets with taunt off will now give a SMALL amount of aggro to their owner (just enough to get their owner on the mob's aggro list), and a LARGE portion of their aggro to other pets with taunt on.\n - Pets with taunt off and an owner who is feigned or invisible will not transfer aggro in this way, but will temporarily lose the ability to be immune to gaining aggro.\n - Fixed pet caption on Charm\n - MR from Gear and Buffs is no longer considered when checking for charm break\n```",
      "author": "catapultam_habeo",
      "timestamp": "2025-03-21T23:04:57.886000+00:00"
    },
    {
      "id": "1349491176792658022",
      "content": "This is a changelog post to test the new patcher.\n\n```\nWords. Changes. Nerfed monks.\n```",
      "author": "apor1a",
      "timestamp": "2025-03-12T21:16:08.881000+00:00"
    },
    {
      "id": "1349425683507708005",
      "content": "Hotfix -> Requires new zone zervers to take effect\n```\n- Fixed pets not correctly calculating spell proc rate\n```",
      "author": "catapultam_habeo",
      "timestamp": "2025-03-12T16:55:54.065000+00:00"
    },
    {
      "id": "1349412549308842084",
      "content": "```\n- Doppelgangers now respect spell recast times of spells they inherit from their owner.\n- Swarm pets inherit spell modifiers from their owner even when their owner has no other pets\n- Zone State restoration is now improved in such a way as to prevent spawning multiple mobs on zone restore.\n```",
      "author": "catapultam_habeo",
      "timestamp": "2025-03-12T16:03:42.628000+00:00"
    },
    {
      "id": "1348875672461901824",
      "content": "```\n- Re-enabled Zone State Preservation\n- Fixed Bazaar Parcel Purchase Discount\n- Fixed incorrect mobs spawning in restored respawning instances\n- Fixed The Polymorphist not accepting Echo of Memory for deity changes\n- Praeserti no longer flee\n- Fixed Bladed Song\n- Removed Parcel fee for Bazaar purchases in EC and Bazaar\n```\n\n(Yes, this changelog is posted again on purpose.)",
      "author": "catapultam_habeo",
      "timestamp": "2025-03-11T04:30:21.213000+00:00"
    },
    {
      "id": "1347823190017052734",
      "content": "```\n- Re-enabled Zone State Preservation\n- Fixed incorrectly calculated stat caps\n- Fixed crash that could occur with certain player events (@Neckkola)\n- Fixed Class-Specific titles not working\n- Fixed Bazaar Parcel Purchase Discount\n- Titles are now deduplicated\n- Fixed incorrect mobs spawning in restored respawning instances\n- Adjusted most Summoned items to not require equipping to cast.\n- Fixed The Polymorphist not accepting Echo of Memory for deity changes\n- Praeserti no longer flee\n- Fixed Bladed Song\n```",
      "author": "catapultam_habeo",
      "timestamp": "2025-03-08T06:48:09.844000+00:00"
    },
    {
      "id": "1347615496207466548",
      "content": "```\n- Updated to EQEmu v23.2\n  - Zone State Preservation\n    - Zone States are now preserved when the zone is internally shut down or the server is restarted\n    - Spawned Mobs (including PH\\Named or scripted spawns), Loot, and other zone parameters will be restored after zone shutdown.\n    - Some EVENT SCRIPTS may still break if you unload a zone during the event. Please report these as bugs.\n  - Fix various crashes (https://github.com/EQEmu/Server/releases)\n\n- Bug Fixes\n  - Fixed ATK not being applied properly from items.\n  - Pet-only spells should more reliably land on pets.\n  - Mobs should no longer summon players under the world.\n  - Beneficial DoT (read, Lich) should no longer break rogue sneak/hide\n\n- BREAKING CHANGE\n  - Items will now attune IMMEDIATELY upon being equipped. No reimbursement will be given for accidentally attuned items.\n  - Items with 'Must Equip' type click effects will ONLY be castable from inventory slots if ATTUNED\n  - Explorer Progression Path is now ACCOUNT BOUND. This will reset progress made at the per-character level. Please contact a guide if you require reimbursement.\n\n- Changes\n  - Players will become immune to being summoned for 10 seconds after being summoned.\n  - Removed Snare and Slow components from shaman Torpor line\n  - Moved shaman Torpor line into short-duration buffs\n  - Echo of Power should now properly stack with all other buffs\n  - Global Buffs should more reliably re-apply.\n  - Removed several useless\\nonworking AA (Extended Shielding, Trap Navigation)\n  - All versions of Dire Charm are now undispellable\n  - Fixed an exploit with Parcels\n  - Adjusted pet aggro transfer rules.\n  - Fixed crash zoning into North Ro\n```",
      "author": "catapultam_habeo",
      "timestamp": "2025-03-07T17:02:51.781000+00:00"
    },
    {
      "id": "1347611729353244775",
      "content": "```\nReturn Bash now available to Paladins and Warriors and functions similarly to Return Kick\n\nThe following items have had their heroic stats and mod2 stats corrected:\n\nCrown of the Defender (Legendary)\nBone Ring of Disharmony (Legendary)\nVial of Suspended Mana (Legendary)\nStrands of Power (Legendary)\nBone Collar of the Possessed (Legendary)\nArmband of Serenity (Legendary)\nBoneweave, Bracer of the Enslaved (Legendary)\nCrown of the Undead Warmaster (Legendary)\nEarring of Death (Legendary)\nEarring of Fond Memories (Legendary)\nGauntlet of the Fire Ring (Legendary)\nGem Encrusted Choker (Legendary)\nSeer's Orb of Power (Legendary)\nSkull Charm of the Oracle (Legendary)\nTotem of the Corpsemaster (Legendary)\nWarmaster's Mask of Battle (Legendary)\nBracelet of the Manawielder (Legendary)\nGrimling Medallion of Power (Legendary)\nGrimling Archmage's Nosering (Legendary)\nMedallion of the Hero of Shar Vahl (Legendary)\n\nAvatar of Agony, Avatar of Suffering, Avatar of Pain, and Avatar of Anguish are now the only mobs on their spawn table.\n\nThe following items are now no drop:\n\nScreaming Sphere\nQuintessence of Elements\nEnchanted Ring of Torden\nSymbol of Torden\nMark of Torture\nMark of Lashing\nMark of Flame\nMark of Stone\nMark of Suffocation\nMark of Execution\nGryme's Crypt Key\nMound of Living Stone\nGlobe of Dancing Flame\nSphere of Coalesced Water\nAmorphous Cloud of Air\nCrystalline Globe\nWind Etched Key\n\nRunic Strike should now stack with Rune\n\nThe following explorer progression items have been made all/all so that they can be leveled by any hero:\n\nMask of Secrets\nSebilite Scale Mask\nHelot Skull Helm\nHelm of Rile\nStronghorn's Horn\nShackle of Auctoririas\nSword of Pain\nSiren Hair Earring\nRing of the Shissar\nShadel Bandit Ring\nZekhas' Katar\nBlade of Insanity\nElemental Binder\nDjarn's Amethyst Ring\nCrown of the Froglok Kings\nScalp of the Ghoul Lord\n\nThe explorer progression path for Luclin no longer requires the Unadorned Scepter and now requires a Burning Ring from Umbral Plains.\n```",
      "author": "apor1a",
      "timestamp": "2025-03-07T16:47:53.693000+00:00"
    },
    {
      "id": "1341103053197283349",
      "content": "```\n- Consolidated Echo of Aegolism, Echo of the Grove, Echo of the Brood, Echo of Focus, and Echo of Koadiac into Echo of Power.\n- Replaced Knight's Rebuke with existing AA: Knight's Return Strike\n- Fixed several errors with Valentine's Day event scripts\n- Prevented Forlorn Follower of Erolisi from replacing certain NPCs\n```\n\nImportant Information & Errata:\n\n- Forlorn Follower of Erollisi are *still* whatever their base NPC is. They still have the same quests, scripts, etc. If you need them to *die* for some event to work correctly, just kill them, don't use their dialogue to make them depop.\n- Echo of Power is not a direct 1:1 comparison to the effects of the old buffs, and may be adjusted in the future. The application of buff scaling makes the consolidated buff scale a little bit differently than the composite buffs.",
      "author": "catapultam_habeo",
      "timestamp": "2025-02-17T17:44:44.372000+00:00"
    },
    {
      "id": "1339745754541064212",
      "content": "```\n- Fixed regression in zone scaling script. Mobs should no longer heal when someone enters or leaves zone\n- Worg pets should no longer try to visually hold weapons.\n- Speculative fix to make glamour appearances more reliable.\n- Adjusted Doppelganger spellcasting priority\n- Adjusted Doppelganger spell stacking\n- Adjusted pet aggro distribution (pet taunt on\\off)\n```",
      "author": "catapultam_habeo",
      "timestamp": "2025-02-13T23:51:19.155000+00:00"
    },
    {
      "id": "1339477902109966367",
      "content": "```\nPlease be aware, Doppelganger is being actively worked on as we try to make it behave more offensively.\n\nWe realize that not being able to control what default spells were being used was not an ideal UX and are working toward a more intuitive spell set.\n\nExpect Doppelganger to cast spells from you bar + their original nukes for now.\n\nThank you!\n```",
      "author": "apor1a",
      "timestamp": "2025-02-13T06:06:58.159000+00:00"
    },
    {
      "id": "1338759014258970654",
      "content": "```\n- Fixed Praesertum Mapta's infinite healing exploit\n- Fixed players being immune to stun for a period of time after being stunned.\n- Removed several undesirable spells from Doppelgangers\n- Doppelgangers no longer use AoE spells of any type from their owner's memorized spell list.\n- Lowered the spawn time of A File Cabinet\n\n- Players will become immune to silence for a period of time after becoming silenced.\n```",
      "author": "catapultam_habeo",
      "timestamp": "2025-02-11T06:30:21.939000+00:00"
    },
    {
      "id": "1338412565780238357",
      "content": "Hotfix\n```\n- Returned Destructive Fury to Wizard AA list.\n- Removed Fear, Blind, and Charm spells from Doppelganger spell lists (requires new zone server, may not work in existing instances)\n- Removed extra 10 ranks of (unpurchasable) Fury of Magic from some classes (will remain visible in bazaar, also a new zone servers thing)\n```",
      "author": "catapultam_habeo",
      "timestamp": "2025-02-10T07:33:42.185000+00:00"
    },
    {
      "id": "1338377526820601906",
      "content": "```\n- Various spells and songs corrected to have haste instead of Slay Undead\n- Lord Inquisitor Seru now correctly uses certain abilities if he has the support of any of his Praeserti\n- Lord Inquisitor Seru's death reward event will now fire more reliabily\n- Many fixes to various encounter scripts (@Trust, @Zimp)\n- Removed Fling effect from Battle Leap (@Aporia)\n- Removed Warders in VT\n- Removed depop timer from The Insanity Crawler\n- XTC unrooted\n- Ssra High Priest unrooted\n- Various double-spawns of bosses in ssrratemple have been removed\n- Shadowstone idol NO-VALUE tag removed\n- Reduced the HP of VT trash by 50%\n- Reduced the respawn time of VT trash to match other XP zones.\n- Bane Weapons will allow skill attacks (Frenzy, Backstab, Monk attacks, etc) to function.\n- A File Cabinet respawn time adjusted to 1 hour, 59 minutes, 59 seconds, making it eligible to spawn in respawning instances.\n- Power Source item growth rate increased. We will monitor this for re-evaluation.\n- Removed ranks 7-9 of Fury of Magic which were incorrectly made available to hybrid classes.\n\n\nDoppelganger Rework\n- The enchanter AA Doppelganger has been largely reworked.\n- Doppelgangers now gain the Equipment, (Long-Duration) Buffs, and Spells of the Enchanter who created them has at time they are created.\n- They will use Nukes, Lifetaps, DoTs, Slows, Debuffs, and Snares. They will NOT use any other type of spell, including AoE spells.\n```",
      "author": "catapultam_habeo",
      "timestamp": "2025-02-10T05:14:28.246000+00:00"
    },
    {
      "id": "1337893727150014565",
      "content": "Pending Reboot:\n\n```\n- Vex Thall Trash HP has been reduced by 50%\n- Vex Thall ZEM has been increased.\n- All VT mobs are a minimum of level 60\n- Fungal Infusion now removes curse counters!\n- Silence on Thall Va Xakra, and Diabo Xi Xin Thall now behave like Aten Ha Ra's. For every 12 seconds you are silenced, you will now have a 12 second reprieve.\n```",
      "author": "apor1a",
      "timestamp": "2025-02-08T21:12:01.416000+00:00"
    },
    {
      "id": "1337209418198286398",
      "content": "THIS CHANGELOG IS ALSO FOR LUCLIN RELEASE AND IS NOT COMPLETE/MAY CHANGE BEFORE LAUNCH\n\n```\n**Balance**\n\n- Cleric's Divine Avatar has been scaled down, but remains one of the most powerful AA's in the game. Duration reduced to 2 minutes. Melee damage bonus and proc chance reduced to 100.\n- Pet's now have a hard cap on how much Flurry, Crit, Crit Damage, and Proc rate they can access (75%/75%/75%/100)\n- Wizard AA Improved Familiar no longer gives stacking critical spell damage (Total decrease of 7.8% with all crit damage buffs going.)\n\n- Warrior's Battle Leap AA duration to 12 seconds and increase damage modifier SPA 185 to 25% at RkI. RkII has been added for purchase for a 50% increase.\n- Warrior's Fellstrike Discipline duration increased to 1.5 min\n- Paladin's Holyforge Discipline now does crit and 50% SPA 185 *instead of crit and crippling blow* but had it's duration reduced to 2 minutes\n- Rogue's Lethality increased to 40% SPA 185\n- Rogue's Thief's Vengeance Discipline was increased to a 12 second duration\n- Rogue only piercers now give additional backstab damage (x3)\n- Druid's Spirit of the Bear now adds 75% SPA 185\n- Druid's Spirit of the White Wolf now reduces spell cost by 20-25%, increases chance to critical heal by 15% and increases the chance to critical heal on a heal over time by 20%.\n- Druid's Spirit of the Black Wolf now reduces spell cost by 20-25%, increases chance to land a critical hit with detrimental spells by 10%, increases critical spell damage by 50%, increases critical DoT chance by 10% and critical DoT damage by 50%\n- Shaman's Rabid Bear proc now has a -50 disease resist modifier and a -50 disease resist check on the proc\n- Shaman's Rabid Bear can now increase the stat cap of Str and Dex by 25/50/75\n\n**Additional Changes:**\n\n- Named mob spawn chance increased in SSRA basement (Strange Green Metal mobs)\n- Bard Hymn of the Last Stand detrimental portion can no longer crit or get modified by spell damage and kill you.\n- Aten Ha Ra's Silence of the Shadows now has a 24s recast time. Word of Command now has a 6s recast time.\n- Fixed several broken spawns in Sanctus Seru\n- Fungal Infusion now gives back 250 endurance in addition to its regular 250 mana\n- Divine Hammer of Consternation and it's Corrupted counterpart now proc Divine Shield instead of Divine Aura\n- Bixie parts can now drop from Bixies in PoM\n- ZEM of Velious zones reduced.\n- ZEM of Luclin zones increased.\n- Thief's Vengeance Endurance cost lowered to 350\n- Mark of Karn now has a -75 resist check and takes only 2 seconds to cast.\n\n**DZs Added**\n\n- Grimling Forest\n- Acrylia Caverns\n- The Gray\n- The Deep\n- The Fungus Grove\n- Umbral Plains\n- Dawnshroud Peaks\n- Twilight Sea\n- Vex Thel\n- Sanctus Seru\n- Katta Castellum\n- Ssraeshza Temple\n- Akheva Ruins\n- Grieg's End\n- Feerrott\n- Lesser Faydark\n- Swamp of No Hope\n\n**The 10th Ring War is now working!** \nA HUGE thank you to Pippz and the many hands that went in to fixing this!\n\n10th Ring War rewards have had their stats increased:\n\n- (Crown of Narandi, only awarded if Churn stays alive)\n- (Eye of Narandi, only awarded if Kurgin stays alive)\n- (Earring of the Frozen Skull, only awarded if Corbin stays alive)\n- (Faceguard of Bentos the Hero, only awarded if Dobbin stays alive)\n- (Choker of the Wretched, only if Garadain stays alive)\n- (Ring of Dain Frostreaver IV, always rewarded)\n\n**The Ring of Fire is in for Luclin!** \nA HUGE thank you to Trust and the hands that went in to testing this!\n```",
      "author": "apor1a",
      "timestamp": "2025-02-06T23:52:49.448000+00:00"
    },
    {
      "id": "1337208133201690625",
      "content": "THIS CHANGELOG IS FOR LUCLIN RELEASE AND IS NOT COMPLETE\n\n```\n- Updated to EQEmu 22.62.2\n- 'Improved the netcode' (@Akkadius)\n\nFixes:\n- Purify Body should now work as expected (@Fluff)\n- BoBs will no longer sell to any merchant regardless of faction\n- Players entering or leaving the zone in a Non-Respawning instance with more than 2 members will no longer cause mobs to heal\n- Faded Memory should spawn for Zlandikar and the other guy\n- Items with slots incorrectly set to only allow one wrist have been corrected to allow both wrists.\n- Fix zone crash that could occur when a script not directly attached to an NPC could instruct a recently dead NPC to Move to a new location.\n- Various NPCs will no longer flee when kicked.\n- Certain tradeskill recipes will no longer return incorrect items via Salvage AA (@Trust)\n- Fixed various luclin encounters (thx @Trust, @Zimp, others)\n- Gnomes can now acquire Tinkering Mastery AA\n- Fixed a number of Haste spells that were actually Slows (Bards, Rejoice!)\n- Fixed Reverse DS effects not working\n- Doppelgangers will no longer use ranged attacks, they will only cast spells.\n\nChanges:\n- Languid Bite and Deep Sleep should now trigger off AA casts (@Zimp)\n- Magicians no longer keep TEMPORARY items unless they have a spell that can summon them (like any other class)\n- Added QUEST tag to most items used in any kind of quest Turn-In.\n- Ring of the Shissar is now No-Trade\n- SPA 185 (SE_DamageModifier) now stacks.\n- Adjusted Arx key to only work inside Sanctus Seru, and be instance aware\n- Lord Inquisitor Seru will banish any attacker who does not possess an Arx \n\nNew:\n- Returned Jolum to the Bazaar\n  - Jolum will exchange your summoned Grandmaster's Satchel for a permanent, 30-slot Grandmaster's Carry-All. This item is LORE.\n  - Grandmaster's Satchel and Grandmaster's Carry-All are now No-Drop.\n- Added 15 additional ranks of Mystical Attuning\n- Added Knight's Rebuke AA for Paladins\n  - Allows Bash on Riposte\n\n\n```",
      "author": "catapultam_habeo",
      "timestamp": "2025-02-06T23:47:43.081000+00:00"
    },
    {
      "id": "1336033147346878590",
      "content": "Posting this early because it went out early\n```\n- Updated Default Maps (@Lachadan)\n- Added Dark Mode maps option (dropdown menu in map window) (@Lachadan)\n```",
      "author": "catapultam_habeo",
      "timestamp": "2025-02-03T17:58:44.623000+00:00"
    },
    {
      "id": "1335823574799224852",
      "content": "```\n- The Echo of the Past for Nagafen's Lair, Permafrost, and Velketor's lab have been moved inside their respective zones. \n- If you see an Echo of the Past in Lavastorm or Everfrost, please ignore them and zone in to the respective zone to pull your DZ.\n- Great Divide still has an Echo of the Past but it is now at the succor location to the south of the zone and is meant to spawn a DZ for Great Divide itself.\n```",
      "author": "apor1a",
      "timestamp": "2025-02-03T04:05:58.634000+00:00"
    },
    {
      "id": "1334900028866826271",
      "content": "```\n- Peridots are no longer marked NO VALUE\n- Fixed Bag of Bartering prompt not displaying in some circumstances.\n- Bag of Bartering prompt is now sorted by item stats and value, but may be truncated for large item lists.\n\n- Reduced packet resend aggressiveness - This may help with connection stability for some users (@Akkadius)\n```",
      "author": "catapultam_habeo",
      "timestamp": "2025-01-31T14:56:08.125000+00:00"
    },
    {
      "id": "1334259808114839553",
      "content": "```\n- Updated to EQEmu v22.61.1\n```\nhttps://github.com/EQEmu/Server/pull/4617\nhttps://github.com/EQEmu/Server/pull/4627",
      "author": "catapultam_habeo",
      "timestamp": "2025-01-29T20:32:07.603000+00:00"
    },
    {
      "id": "1332857825009078393",
      "content": "```\n- Fixed Guild Member level display. (Client Patch Required)\n```",
      "author": "catapultam_habeo",
      "timestamp": "2025-01-25T23:41:08.783000+00:00"
    },
    {
      "id": "1332759507641827409",
      "content": "Pending Server Reboot:\n\n```\n- Consolidated logic on both populating and executing Bags of Bartering. This should reduce confusion and increase accuracy about which items are actually eligible to be sold.\n- Berserker Summoned Axes may no longer be vendored\n- No-Rent items may no longer be vendored\n- Items with Augments may no longer be auto-vendored\n- Removed a bunch of inaccessible NPCs from the Bazaar\n- Added NO-VALUE tag to many items given by trivial quest scripts.\n- Added NO-VALUE tag to all summoned items\n- All players with Tracking should now be able to filter track results (@Salty)\n- Fixed memory leak in client which caused map to not properly reset spawn lists under some circumstances (@dannuic)\n- Reduced the 'merchant multiplier' on most items.\n- Fixed several memory leaks (@Akk)\n- Re-enabled direct inventory delivery via Delivery Vouchers\n- Adjusted client memory map in a speculative fix for out of memory client crashes (@Drake)\n\nQuest Fixes:\n- Quests fixes related to Qeynos Badge (@Trust)\n- Implemented JFP War (@Trust)\n- Cleaned up Shaman Cudgel & Skull quest (@Trust)\n  - Added Flags to each step to monitor progress\n  - Added faction and level checking per step\n  - Added notice of flags being assigned (So they are not \"Invisible\")\n  - Added Dialog to Oxyn \"Progress\" that will output current progress point.\n  - Limited a quest turn-in that can be exploited for fast and unlimited EXP\n- Misc Befallen cleanup (@Trust)\n- Fixed Faction hits around Giant Scarab quests in Kaladim (@Trust)\n- Various Quest fixes in qey2hh1 (@Trust)\n- Corrected several quests which rewarded the wrong items.\n\n- Added Mystic Soulbinding Apparatus to Gemcrafter Anuk This reusable device allows you to attune any item, preventing it from being accidentially sold or|| traded.\n\n- Unflinching Resolve and Stalwart Endurance have been removed from the game.\n- Any player that has a single point of Unflinching Resolve or Stalwart Endurance will be given Steadfast Will\n\n- The vendor cost of items has increased as the sell value on some has increased.\n\n```",
      "author": "apor1a",
      "timestamp": "2025-01-25T17:10:28.096000+00:00"
    },
    {
      "id": "1332028783162818775",
      "content": "```\n- Items should now never be able to be sold for more than they are bought for.\n- No-Rent items can not be sold via Bags of Bartering\n- Custom Pet Names restored\n```",
      "author": "catapultam_habeo",
      "timestamp": "2025-01-23T16:46:49.804000+00:00"
    },
    {
      "id": "1331997123805184092",
      "content": "```\n- Type 21 Glamour-Stones no longer require item type armor\n- Fixed EoM-purchased Gnomish Quadramorphic Combinerator\n- Bazaar Parcel Fee removed when inside the Bazaar (any instance)\n- Disabled 'Warp to Trader' functionality from Find Trader\n- Changing Pal\\SK Epic from one form to another will no longer eat augs\n\n- Added Delivery Vouchers & Direct to Inventory Delivery\n  - Purchased from Merchant Aina for platinum\n  - Purchased from Echo of Memory for EoM\n  - Each direct to inventory delivery will consume 1 Delivery Voucher from your Alt Currency.\n\n- Increased standard stack size to 1000\n- All items have a sell value based on stats.\n- Item Previews are now avaiable (alt-rightclick item icon in 'item inspect' window) (@dannuic)\n```",
      "author": "catapultam_habeo",
      "timestamp": "2025-01-23T14:41:01.625000+00:00"
    },
    {
      "id": "1331723721295003740",
      "content": "Changes:\n```\n- Kildrukaun the Ancient's Typhoon Breath now casts once every 45 seconds instead of 15.\n- Bladesoul's Spiritual Diadem now correctly classified as armor\n- Lvl 50+ Druid and Shaman pets will now benefit from Pet Power 15, 20, and 25.\n- Misc item description updates\n- A Knight of Luclin now correctly reports the targets needed for Luclin unlock\n- Fixed Z-axis of ground spawns in Lake Rathe\n- Key of Torsis is now correctly set to a 100% drop rate\n- Stun Resist AAs are being squished to prevent overflows. Steadfast Will will now be available for (WAR/PAL/SK/MNK/BER). Dauntless Perseverance has been removed entirely as stun resist > 100 does nothing. \n```\n\nPending Patch:\n```\nUnflinching Resolve and Stalwart Endurance have been removed from the game.\n- Any player that has a single point of Unflinching Resolve or Stalwart Endurance will be given Steadfast Will on next downtime.\n```",
      "author": "apor1a",
      "timestamp": "2025-01-22T20:34:37.387000+00:00"
    },
    {
      "id": "1329893093335371877",
      "content": "CHANGES\n\n```\n- Kerafyrm event adjusted.\n  - Typhoon Breath has had its curse counters cut in half and it's cooldown tripled. \n  - The Warders have been reintroduced to the pool of potential adds for the ecnounter.\n- Fixed missing 'the Naughty' and 'the Grinch' titles\n- Fixed Double\\Triple attack not working for Throwing\n- Rysva To`Biath will now allow completion of the Book of Scale quest\n- Instant-Cast clickies can be activated while singing bard songs (@Zimp)\n- Improved logic around rune stacking with regard to bard songs (@Zimp)\n- Reverted change that resulted in bags not being able to be sold back to EoM vendor\n- Unattuner and Gnomish Quadramorphic Combinerator can only be sold back to EoM vendor if they were purchased with EoM\n- Unattuner and GQC is no longer NO-DROP\n- Vibrating Gauntlet\\Hammer of Infuse will preserve augments when swapping (invalid augs will fall out)\n- Characters with a Trader's Satchel in their inventory who find themselves in a zone other than Bazaar will be moved back to Bazaar\n\n- Fixed inspect item not working when outside of the instance containing a Bazaar trader.\n- Fixed off-by-1 error with regard to Bazaar Shard numbering\n\n- Added Bag of Bartering and Belt Pouches of Bartering to Echo of Memory in Bazaar\n - These bags will allow you to Sell All or Keep One Per Stack of their contents when interacting with a Merchant\n - Bag of Bartering - 30 slots, Max Size Giant, 100% WR\n - Belt Pouches of Bartering - 100 slots, Max Size Small, 100% WR\n   - Pro Tip: Put this one in your LAST inventory slot to act like a 'filter' for preconfigured junk in combination with 'Keep One Per Stack' sell mode\n```\n\nKNOWN ISSUES\n```\n- Traders in Bazaar Shard 1 will show as their name if you are in any open world zone, not just the Bazaar\n```\n\nEXTRA\n```\nAn EXPERIMENTAL client configuration change has been added to the 'extra' directory in the patcher. BACK UP and then replace your 'resources/Memory.ini' file with this if you experience frequent crashes while zoning, especially if you have gone to discord for help and been told it was the 'graphics memory crash'. \n```",
      "author": "catapultam_habeo",
      "timestamp": "2025-01-17T19:20:21.670000+00:00"
    },
    {
      "id": "1329465177497665590",
      "content": "Pending Reboot:\n\n```\n- Typhoon Breath has had its curse counters cut in half and it's cooldown tripled. \n```",
      "author": "apor1a",
      "timestamp": "2025-01-16T14:59:58.584000+00:00"
    },
    {
      "id": "1329263425905229878",
      "content": "NINJA CHANGELOG\n```\n- Polymorphist now properly accepts EoM\n```",
      "author": "catapultam_habeo",
      "timestamp": "2025-01-16T01:38:17.256000+00:00"
    },
    {
      "id": "1328936987754889247",
      "content": "BONUS CHANGELOG\n```\n- Lokar To`Biath in neriakc now accepts stacks of items.\n- Lashun Novashine in North Qeynos now accepts stacks of items.\n- Captain Tillin in South Qeynos now accepts stacks of items.\n- Captain Bosec in Highkeep now accepts stacks of items.\n- Trooper Mozo in Cabilis now accepts stacks of items.\n- Pandos Flintside in West Freeport now accepts stacks of items.\n- Niola Impholder in South Felwithe now accepts stacks of items.\n```",
      "author": "catapultam_habeo",
      "timestamp": "2025-01-15T04:01:08.336000+00:00"
    },
    {
      "id": "1328923023532752966",
      "content": "```\n- The Polymorphist now allows you to set custom pet names\n  - Default pet names have been reset as part of moving to new pet name system\n- All Polymorphist services may now be purchased with platinum.\n\n- Purchasing via Parcel from Bazaar now adds parcel tax once again\n- Bazaar trader cap lifted.\n- Traders not in-zone will display as 'Bazaar Shard N' where N is the shard where they are located\n\n- Kerafyrm encounter adjusted.\n- Wizard Familiar spells no longer spawn a flappy\n- Cycle Pet\\Self hotkey will now cycle between all pets (@Salty)\n- Removed servers other than THJ from server list (@Splose)\n\n- Blinded By Fury is now a short-duration buff that is not suspend-able.\n- Frenzy Weapon Scaling is now sum of Primary + Secondary\n- Added Tunable to Frenzy Weapon Scaling (default same value as before)\n  - FrenzyScaleOnWeaponAmount\n- Added Monk Kick\\Strike weapon damage scaling and tunable.\n  - MonkScaleOnWeaponAmount\n- Added Monk Kick\\Strike Hand\\Foot damage scaling and tunable\n - MonkScaleOnHandFeetQuality\n```",
      "author": "catapultam_habeo",
      "timestamp": "2025-01-15T03:05:39.006000+00:00"
    },
    {
      "id": "1327449601371934735",
      "content": "Pending Patch:\n\n```\n- Burned Out Lightstone no longer glows so bright\n- Echo of the Past should now be findable\n- Lioness Matriarch and Lion Patriarch can now drop Lion Skins in addition to pelts. (Fleeting Quiver seekers rejoice)\n- Killing Dozekar the Cursed now correctly spawns A Faded Memory\n- Killing Kelorek`Dar now correctly spawns A Faded Memory\n- Paladins now have access to the Shield Specialist AA\n- The Shield Specialist AA has been increased for Warrior and Paladin to increase auto attack damage with your primary weapon by 20/40/60/80/100%\n- Paladins now have access to the Holy Shield AA (The Paladin's shield is imbued with holy light increasing the Paladin's chance to proc all effects and allows the Paladin to cloak themselves in a runic shield while fighting. Requires maximum rank in Shield Specialist.)\n- The Vicious Smash AA has had its effect doubled.\n- A Tribute Master has been added to EC Tunnel\n- Certain legendary items have had their missing stats added back.\n- The Endless Cookie Platter now let’s you know that you do, indeed, summon a cookie.\n- Updated description of Paladin Discipline Holyforge to indicate its effect against *all targets*. (This was always the case, most people just didn’t know.)\n- Snarla the Fang now gives the correct faction\n- Druid AA Wrath of the Wild tooltip has been updated to reflect its current implementation: “This ability will shield you with a charge based, large damage barrier of thorns. When each charge is consumed there is a chance to grant the player an additional blessing: Protection of the Spirit Wolf.”\n- Enchanter AA Hastened Edict of Command has had Rk 1/2/3 added to the game. Rk3 brings the CD of Edict down to 30 minutes.\n- Berzerker AA Hastened Savage Spirit is now available with the final rank bringing its CD to 20 minutes.\n- Rogue AA Hasty Exit has had ranks added bringing its final CD to 5 minutes.\n```",
      "author": "apor1a",
      "timestamp": "2025-01-11T01:30:47.788000+00:00"
    },
    {
      "id": "1324929653957328956",
      "content": "```\nNew:\n- The Heroes' Journey patcher will now automatically back up your UI configurations and detect when they have become corrupted. (Thanks @Xackery!)\n\nAdjustments:\n- Bristlebane has been rebalanced\n- Gaining XP while at AAXP cap no longer sets percentage of XP assigned to AA to 0%.\n\nBug Fixes:\n- Countless script fixes (Thanks @Trust!)\n- Traders should now be cleaned up if a zone server crashes (@Neckkola)\n- Fixed a memory leak in pet bags\n- All Handin quests should now work\n\n```\n\nAdditionally; it is now possible for us to update quest scripts to allow handing in stacks at a time. This requires reworking the script, however, and so will not be a global change.\n\nWe are crowdsourcing quests which would benefit from this treatment -> [Here](https://docs.google.com/document/d/1D-BxDDT6pFQHfxA6dcqdbxU9f2mMFgvtZbTvMomF47E/edit?tab=t.0)",
      "author": "catapultam_habeo",
      "timestamp": "2025-01-04T02:37:25.506000+00:00"
    },
    {
      "id": "1324112534776713266",
      "content": "Out of respect for player time and expected engagement, the following changes have been made:\n\n```\n- Non raid bosses in ToV have had their HP reduced.\n- Thifling Focuser's in PoG have had their HP reduced.\n```",
      "author": "apor1a",
      "timestamp": "2025-01-01T20:30:29.112000+00:00"
    },
    {
      "id": "1324047001591091262",
      "content": "```\n- Implemented limit of 599 total active traders to work around client bug (More comprehensive workaround to come)\n```",
      "author": "catapultam_habeo",
      "timestamp": "2025-01-01T16:10:04.783000+00:00"
    },
    {
      "id": "1323716631951577148",
      "content": "```\n- Enchanter AA Mana Draw now has a 10 minute CD with Rk3 Hastened Gathering\n- The Sleeper will no longer reset his HP to full when he roars.\n- The Sleeper will now despawn his adds from phase 4 if a player dies and re-engages at full health.\n- Misc Faction fixes (Thanks Trust!)\n```",
      "author": "apor1a",
      "timestamp": "2024-12-31T18:17:18.523000+00:00"
    },
    {
      "id": "1323713355206234286",
      "content": "```\n- Experimental change for /baz crash\n- Experimental change for crash-on-zone\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-12-31T18:04:17.286000+00:00"
    },
    {
      "id": "1323409018273923123",
      "content": "I am a generous god.\n```\n- The Vision of Ayonae will now allow you to reduce your level, and return to up to your previous maximum level. This service costs 500pp per level changed.\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-12-30T21:54:57.707000+00:00"
    },
    {
      "id": "1323104912036462603",
      "content": "```\nAdded:\n- Urthron's Ultimate Unattuner has been added for sale from Gemcrafter Anuk\n- Gnomish Quadramorphic Combinerator has been added for sale from Gemcrafter Anuk\n- Vial of Prismatic Dye has been added for sale from Gemcrafter Anuk\n\nAdjusted:\n- Donal's Chestplate of Mourning now casts regular Complete Heal with a 30 second recast\n- Melodic Breastplate clicks at level 1.\n\nUX:\n- Pets will no longer accept a Syncrosatchel which is traded to them.\n\nBug Fixes:\n- Turn-ins with multiple identical items will once again function (@Akk)\n- Recovering Parcels will no longer require an open top-level inventory slot (Thanks @Neckkola)\n- Items with charges will no longer be interpreted as stacked items for quest turnins. (@Akk)\n- Restored No-Rent\\Temporary item timer to 1800 seconds (was set to 1 second for debugging, which made it to prod)\n- Non-Mages who can summon an item will find that those items are much more permanent.\n- Corrected model for velium spiders in Velketor's Labyrinth\n- Corrected model for crystal golems in Velketor's Labyrinth\n- Corrected model for gargoyles in Velketor's Labyrinth\n- Corrected model for Velketor the Sorcerer\n- Corrected model for Snow Cougars\n- Corrected a script error in Dain Frostreaver IV\n- Thunder Spirit Princess will once again accept 10 gold\n- Fixed zone crash on conning mobs in some edge cases\n- Fixed zone crash on handing items to pets in some edge cases\n- SE_FadingMemories no longer applies to the caster of the effect instead of the target when applied to an NPC.\n- Pets are cleaned up on death once more\n- Fixed bad plat handling on Purveyor of Glamour and a few other NPCs\n- Tradeskill combines will display skill-up messages.\n- GM Training will display skill-up messages.\n- Custom Helms will now return the correct quality\n- Reworked Tunare encounter (@Trust)\n- Reworked Bristlebane encounter (@Trust)\n- Reworked TOFS mirrors and keys (@Trust)\n- Added DZs for TOFS, CC, Iceclad\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-12-30T01:46:33.130000+00:00"
    },
    {
      "id": "1321688812581027932",
      "content": "Rolling log for *TEST* while I get velious ready.... Final patch notes will be re-posted prior to Velious launch.\n```\nNew:\n- Added per-class pet bags. See bag vendor in the Bazaar or Shady Swashbuckler in EC Tunnel. If you choose not to use a pet bag, no item reimbursements will be given for lost items.\n- Reworked NPC hand-ins, it should now be impossible to hand an item to an NPC and have it eaten (other than pets without a pet bag).\n\nRemoved:\n- Charmed pets will no longer hand back items given to them. Use a Syncrosatchel to equip your pet or rely on vanilla charm-gear mechanics.\n\nBug Fix:\n- Corrected bug applying spell damage\\crit incorrectly to pets\n- Corrected bug preventing heal amount from being applied to pet procs\n- Corrected bug preventing spell damage from being applied to pet DoT procs\n- Pets using 2h weapons no longer reduce added damage by 1/2\n- No-Rent\\TEMPORARY bags should now correctly be replaced by their disenchanted versions instead of destroying their contents.\n- Pets should no longer be deleted for players who are logged on as the server goes down.\n- Berserker Disciplines should no longer be removed when dropping (non-Berserker) classes.\n- Spells that you can no longer cast because of deleveling are no longer removed when dropping classes.\n- Sympathetic Procs will no longer trigger twice for one of your pets.\n- *Most* pets may once again be shrunk. Some are buggy still, working on it.\n\nAdjusted:\n- Pets now inherit 50% of their owner's spell damage, heal amount, critical spell damage and critical healing on procs\\spells.\n- Pets with 2H weapons equipped no longer equip an offhand.\n- Pets use equipped weapon delay instead of standard NPC delay.\n- Pets base damage is normalized to their new attack delay.\n- Pets directly add their equipped weapon damage to their attacks.\n- Syncrosatchels increased to 4 slots.\n- TEMPORARY items will not expire while logged off if you can summon that item via a spell in your spellbook. (Or, for now, are a Magician)\n- All spells should be deletable from spellbook (Requires additional client patch)\n\nMisc:\n- Progression targets for Luclin unlock have been finalized; Zlandikar, Klandikar, Wuoshi, Kelorek'Dar, and Dozekar the Cursed\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-12-26T03:59:28.710000+00:00"
    },
    {
      "id": "1321237072048033833",
      "content": "New **TEST** build\n```\nNew:\n- Added per-class pet bags. See bag vendor in the Bazaar. If you choose not to use a pet bag, no item reimbursements will be given for lost items.\n- Reworked NPC hand-ins, it should now be impossible to hand an item to an NPC and have it eaten (other than pets without a pet bag).\n\nRemoved:\n- Charmed pets will no longer hand back items given to them. Use a Syncrosatchel to equip your pet or rely on vanilla charm-gear mechanics.\n\nBug Fix:\n- Corrected bug applying spell damage\\crit incorrectly to pets\n- Corrected bug preventing heal amount from being applied to pet procs\n- Corrected bug preventing spell damage from being applied to pet DoT procs\n- Pets using 2h weapons no longer reduce added damage by 1/2\n- No-Rent\\TEMPORARY bags should now correctly be replaced by their disenchanted versions instead of destroying their contents.\n\nAdjusted:\n- Pets now inherit 50% of their owner's spell damage, heal amount, critical spell damage and critical healing on procs\\spells.\n- Pets with 2H weapons equipped no longer equip an offhand.\n- Pets use equipped weapon delay instead of standard NPC delay.\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-12-24T22:04:25.374000+00:00"
    },
    {
      "id": "1321019345039790141",
      "content": "The below is deployed on THJ Test Server and is available for further testing.\n\nMerry Christmas?\n\n```\nNew:\n- Added per-class pet bags. See bag vendor in the Bazaar. If you choose not to use a pet bag, no item reimbursements will be given for lost items.\n- Reworked NPC hand-ins, it should now be impossible to hand an item to an NPC and have it eaten (other than pets without a pet bag).\n\nRemoved:\n- Enchanter pets will no longer hand back items given to them. Use the Enchanter's Syncrosatchel to equip your pet or rely on vanilla charm-gear mechanics.\n\nBug Fix:\n- Corrected bug applying spell damage\\crit incorrectly to pets\n- Corrected bug preventing heal amount from being applied to pet procs\n- Corrected bug preventing spell damage from being applied to pet DoT procs\n- Pets using 2h weapons no longer reduce added damage by 1/2\n\nAdjusted:\n- Pets now inherit their owner's spell damage, heal amount, critical spell damage and critical healing on procs\\spells, split evenly between all (non-swarm) pets owned by their owner.\n- Pets with 2H weapons equipped no longer equip an offhand.\n- Pets use equipped weapon delay instead of standard NPC delay.\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-12-24T07:39:15.210000+00:00"
    },
    {
      "id": "1320638822970687630",
      "content": "Deployed\n```\n- Shadowknight pets now have their own unique spells\n - Each has (SHD) appended to the spell name\n - New scrolls added to Bazaar spell vendors\n - Vision of Ayonae can help you unmem spells (say 'unmem') if you have a now-uncastable spell memorized.\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-12-23T06:27:11.679000+00:00"
    },
    {
      "id": "1320539762389422122",
      "content": "Deployed\n\n```\n- Paladin AA Blessing of Life Rk 2 and 3 now available for an increased base heal amount and proc rate.\n- Paladin AA Healing Light Rk 2 and 3 now available for an increased proc rate (up to 30%)\n```\n\nDeployed\n```\nAll single target Paladin stun spells now have a small damage component to proc Sympathetic Strike.\n```",
      "author": "apor1a",
      "timestamp": "2024-12-22T23:53:33.796000+00:00"
    },
    {
      "id": "1320263658823221339",
      "content": "Small WIP Changelog...\n```\n- Reworked Clockwork Banker & Resupply Agent Tools\n - No longer uses a pet slot\n - Summoned for 15 minutes or until owner leaves the zone\n - Can only summon one of each type at a time\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-12-22T05:36:25.576000+00:00"
    },
    {
      "id": "1319751613853859863",
      "content": "Consolidated Changelog\n```\n- Unattuner works again\n- Added 10 titles for prolific Gamblers.\n- Added title for owning a Vial of Prismatic Dye\n- Glamour-Stones now have teal names.\n- Guild Names and permissions should now propagate to all zone servers correctly.\n- Additional perfomance improvements around Bard Songs.\n- Pets which you cannot cast no longer survive your death (the same as buffs).\n\n\n - Creatures all across Norrath, Luclin, and the Planes have come into possession of Strangely Wrapped Gifts\n - Strange Elves from beyond this world have appeared in the Bazaar and EC Tunnel, seeking these gifts.\n - Do you open them? Or return them?\n\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-12-20T19:41:44.542000+00:00"
    },
    {
      "id": "1318262438977736856",
      "content": "ROLLING DEPLOYMENT (Will be inconsistent which zones this works on until next reboot. Do not expect bazaar to be effected)\n```\n- Unattuner should now function again\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-12-16T17:04:17.584000+00:00"
    },
    {
      "id": "1318237038197342208",
      "content": "```\n- Glamour-Stones now have teal names.\n- Added `missingspells` argument to `/outputfile`. Use like `/outputfile missingspells [filename]` (where `filename` is optional) to output a level-sorted list of spells to a file in your EQ directory. File name defaults to `<character>-MissingSpells.txt`. (Thanks @dannuic)\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-12-16T15:23:21.566000+00:00"
    },
    {
      "id": "1317589922177093672",
      "content": "```\n- Added title for owning a Vial of Prismatic Dye\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-12-14T20:31:57.084000+00:00"
    },
    {
      "id": "1317579139951235225",
      "content": "DEPLOYED\n```\n- Added 10 titles for prolific Gamblers.\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-12-14T19:49:06.401000+00:00"
    },
    {
      "id": "1317508462522925087",
      "content": "12/14/24\n\nBug Fixes\n```\n- Implemented experimental change to fix the 'no cast bar' bug. This MAY reintroduce a worse bug, but looks good in brief testing. Please report any instances of randomly not being able to cast or perform certain other activities.\n- All starting AA now cost 0 points; this may cause your current 'spent' AA total to decrease when it is next updated.\n- Significantly reduced the complexity of checking for bard song auto-refresh\n- Poisons are no longer equippable.\n- Removed several remaining class checks on epics.\n```\n\nNew Features\n```\n- The Purveyor of Glamour will create Glamour-Stones (Transmog Ornaments) for Armor!\n  - NOT Hero's Forge.\n  - Works with modern & legacy player models\n  - 5Kpp + sacrificial item\n  - Not Dyable\n\n- Removed tradeskill recipe for Vial of Prismatic Dye\n- Added Vial of Prismatic Dye to Augs merchant in Bazaar\n- Adjusted Vial of Prismatic Dye pricing (Sell from vendor @ 50k, Buy from vendor @ 100p)\n\n- The Purveyor of Glamour will now create 'Hero's Forge' style Armor Glamour-Stones!\n  - Generated through 'custom work' randomization system\n  - 2 EoM each, tradable.\n\n- The Vision of Ayonae can now reset your AA!\n  - Each character gets one free reset\n  - Subsequent resets cost 10 EoM and incur a stacking 7 day cooldown (identical to dropping a class)\n\n- Added Petamorph Wands: Wrulon, Phoenix (Red, Blue), Telmira, Stoneworker, Giant Ant, Gorilla, Crushbone Orc, Lightning Dervish, Lava Dervish, Stone Dervish\n- Pets will spawn using the appearance of any equipped Petamorph Wands\n```\n\nThe Vial of Prismatic Dye changes are likely going to be something that many people disagree with. We are choosing the take a different experience for armor appearance customization on this server vs official or other emulated servers. I feel that armor dyes are a 'quick and dirty' solution that allows getting whatever appearance you want quickly and easily, and removes a lot of the fun in finding the exact combination of gear to achieve the look you want. Transmog accomplishes this better, and serves as a plat sink that we definitely need. However, I am leaving Dyes in-game, for those who do want to use that shortcut, with an additional plat sink component.\n\n\nAdditionally, for those who do not want to deal with Heros' Forge armor appearances, please remember they can be disabled in the Options menu.",
      "author": "catapultam_habeo",
      "timestamp": "2024-12-14T15:08:15.589000+00:00"
    },
    {
      "id": "1316571786611261500",
      "content": "Consolidated Changelog\n\n```\n- Corrected Veterancy scaling formula to correctly function near the end of the scaling range\n- Fixed SE_GiveDoubleRiposte (Knave's Return Stab, Furious Refrain, Return Kick, etc)\n- Probably fixed UCS problems again (thanks @Akk)\n- Removing a class no longer removes spells you can still use due to other classes\n- Removing a class unequips items which are no longer usable\n- Removed Class Requirements from all epic quests (Thanks @Prymetyme)\n```\n\nRolling Deploy (Requires new zone server; new DZ does not guarantee this)\n```\n- Detrimental Sympathetic procs should no longer target their caster under any circumstance\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-12-12T01:06:14.649000+00:00"
    },
    {
      "id": "1316438968958455849",
      "content": "```\n- Removed Class Requirements from all epic quests (Thanks @Prymetyme)\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-12-11T16:18:28.453000+00:00"
    },
    {
      "id": "1316279399741657161",
      "content": "Rolling Deploy (Requires new zone server; new DZ does not guarantee this)\n```\n- Fixed SE_GiveDoubleRiposte (Knave's Return Stab, Furious Refrain, Return Kick, etc)\n- Probably fixed UCS problems again (thanks @Akk)\n- Removing a class no longer removes spells you can still use due to other classes\n- Removing a class unequips items which are no longer usable\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-12-11T05:44:24.187000+00:00"
    },
    {
      "id": "1315493798641401887",
      "content": "Rolling Deploy (Requires new zone server; new DZ does not guarantee this)\n```\n- Corrected Veterancy scaling formula to correctly function near the end of the scaling range\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-12-09T01:42:42.289000+00:00"
    },
    {
      "id": "1315454822505517128",
      "content": "Hotfix\n```\n- Reduced maximum veterancy bonus from 5x to 3x AAEXP\n```\n\nThis impact of the change allowing Veterancy to apply AFTER the per-kill cap was significantly greater than appeared in testing. This change will still result in overall higher AAEXP rates than prior to the most recent patch.",
      "author": "catapultam_habeo",
      "timestamp": "2024-12-08T23:07:49.654000+00:00"
    },
    {
      "id": "1315352052188184646",
      "content": "Deployed\n```\nQuests\n- Revamp of 'Thieves Aboard the Ship' event (Thanks @Trust)\n- Plane of Sky keys are no longer removed from inventory when leaving the zone (Thanks @Trust)\n\nBug Fixes\n- Apply MeleeLifeTap to Archery damage\n- Temporary Stun Immunity after being stunned now correctly applies to non-spell stuns.\n- Flags should be consistent between different zones.\n- Worn ATK is no longer double-counted under certain circumstances.\n\nMisc\n- Bonus AAEXP from Veterancy will now give feedback indicating when the bonus will end.\n- Bonus AAEXP from Veterancy is now applied after the per-kill AAEXP cap.\n- Revamped Healing messages\n- Revamped Rune messages\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-12-08T16:19:27.301000+00:00"
    },
    {
      "id": "1315148539457703938",
      "content": "Deployed:\n\n```\n- Extended Ingenuity AA has been enabled for Bards\n- Bladed Song is now unresistable and has had a second rank added.\n- Dance of Blades, Bladewhirl Proc now has a -100 chromatic check on landing. It's AC shred and resist debuff now scales with level.\n- Funeral Dirge now increases physical damage taken by 10/15/20% and has had its duration doubled\n- Hastened Funeral Dirge AA is now available (5 Rks) putting Funeral Dirge down to 10 minutes at max level\n- Song of Stone has had its pet stats increased significantly and its cooldown reduced significantly\n\nThese changes were made to reinforce the support nature of the Bard and its viability across multiple builds.\n\nThank you for your patience as we continue to try navigate player feedback!\n```",
      "author": "apor1a",
      "timestamp": "2024-12-08T02:50:46.085000+00:00"
    },
    {
      "id": "1314840330230566975",
      "content": "Rolling Deployment (Will show up in zones other than the bazaar as time goes on, after reboot will be effective everywhere)\n```\n- Adjusted spell damage messages to show spell, and pet owners.\n- Adjusted DoT damage messages to be normal non-melee hits\n- Potentially fixed Explorer path progression quests not unlocking flags reliabily\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-12-07T06:26:03.279000+00:00"
    },
    {
      "id": "1314802696938586153",
      "content": "Deployed (Client Patch)\n```\n- ACTUALLY FIXED NOCLIP OBJECTS (Thanks @Bakemono for enormous troubleshooting help)\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-12-07T03:56:30.803000+00:00"
    },
    {
      "id": "1314426106375573516",
      "content": "Deployed (-ish)\n```\n- Fixed 'Spells are 255 until you zone once'\n- Possibly fixed some pets poofing on server-down (Sorry, it won't work on the next server-down, probably)\n- Disc timers are no longer transferred to new characters when you camp to character select and switch toons\n- Spell Procs added by buffs must be unique (@Grek)\n- Potentially fixed client memory leak causing collidable objects to no longer be collidable\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-12-06T03:00:04.616000+00:00"
    },
    {
      "id": "1314128377191465030",
      "content": "Deployed\n```\n- Fix for crash-on-zone for some clients\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-12-05T07:17:00.447000+00:00"
    },
    {
      "id": "1313560375739941017",
      "content": "12/3/24\n\nPending Reboot & Patch\n```\n- Corrected Hoshkar AoE to apply a sane slow effect, instead of a negative attack speed\n- Para Dar's Slow AoE is now curable.\n- Corpse decay time will never be longer than the respawn time of the mob.\n- Hunter's Fury should no longer block Trueshot Discipline\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-12-03T17:39:58.348000+00:00"
    },
    {
      "id": "1313276869738631230",
      "content": "```\n(Quests, Deployed)\n- Re-enabled 'Slayer Titles'\n- Various fixes to Toirgan Mines scripts (@Trust)\n- Various quest and script fixes (@Grek)\n- Various quests and script fixes (@Trust)\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-12-02T22:53:25.250000+00:00"
    },
    {
      "id": "1313142732813766719",
      "content": "Deployed\n```\n- Experimental fix for those crashing on logging\\zoning into the Bazaar\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-12-02T14:00:24.515000+00:00"
    },
    {
      "id": "1312932176060223628",
      "content": "Deployed\n```\n- Combat Skill activation should no longer impose a 1-second cooldown on other skills.\n- Adjusted Map targeting range again\n- Doubled Tracking\\Situational Awareness range for mobs that you have LoS on\n- Cleaned up parsed spell information for SPA relevant to Sympathetic Healing\n(If you are interested in helping to clean up the spell parser in general, and are comfortable working with C-Strings, hit me up! There's a pile of EOM)\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-12-02T00:03:43.873000+00:00"
    },
    {
      "id": "1312645296576135229",
      "content": "```\nRejoice.\n- /friend works correctly again\n\nRejoice harder.\n- /ignore works correctly again\n\n(Thanks Akk!)\n```",
      "author": "apor1a",
      "timestamp": "2024-12-01T05:03:46.474000+00:00"
    },
    {
      "id": "1312621082380992636",
      "content": "```\nOption added to Omat Vastsea's quest script to summon back Natasha to make it easier for players who ran into issues during the Cleric epic to fix their quest state.\n\nBy saying \"I wish to see Natasha\", you can trigger a spawn of Natasha. Who is now immune to player damage.\n\nThank you Grig\n```",
      "author": "apor1a",
      "timestamp": "2024-12-01T03:27:33.360000+00:00"
    },
    {
      "id": "1312479580904362005",
      "content": "Deployed\n```\n(Client Update, DEPLOYED)\n- Experimental Fix for 'You can't use that command right now...` while spamming Disciplines\n- Even Better fix for 'You can't use that command right now...` while spamming Disciplines\n- Doubled Target Range on Map.\n- Improved Map performance.\n\n(Server Update, DEPLOYED)\n- Prevent slow effects from causing uninitialized skill timers to be set to ~80 years in the future\n- Situational Awareness AA adjusted to provide effective skill instead of actual 'skill points'.\n- Haste now displays on a scale starting at 0%.\n- Haste is no longer over-applied to activated Melee skills (Kick, Bash, Backstab, Frenzy, etc).\n- Moved several previously unfilterable combat messages (Master Wu, Strikethrough, Stun) to Skills chat-window filter. Options filter window is unchanged.\n- Dispel should no longer trigger a lag spike for some players.\n- Pets will prioritize equipping items in their primary and secondary slots ahead of any other slots.\n\n(Quests, DEPLOYED)\n- The Polymorphist will now allow you to change Deity.\n- The Polymorphist will now allow you to 'reset' a pet name, so a new random static will be generated the next time you summon that pet type.\n- Solomen will now respond to his linked prompt.\n- Tomekeeper Dahl will no longer eat items turned in by non-Monks.\n- Deep will no longer eat items turned in by non-Monks (@Grek)\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-11-30T18:05:16.779000+00:00"
    },
    {
      "id": "1312210013049061387",
      "content": "```\n- Scale armor and other chain like armor with missing graphics should now be fixed\n- Hastened Celestial hammer has had its pre-requisites removed\n- Many AA descriptions updated (thank you Alebrije)\n- Misc quest fixes\n- Echo added to Kaesora\n- The Tangrin respawn time reduced\n- Account actions taken around custom Macro Quest sources.\n- Turkeys are no longer lore, but are now no-drop \n- Pumpkin Spice Latte is now no-drop\n- Turkeys and Pumpkin Spiced Lattes now have a rare chance to drop from enemies until Sunday night\n- Echo added to Highpass (I couldn't trust rogues to play nice...)\n- Quest EXP temporarily disabled\n```",
      "author": "apor1a",
      "timestamp": "2024-11-30T00:14:06.794000+00:00"
    },
    {
      "id": "1311563335329779764",
      "content": "Pending Reboot/Patch:\n\n```\n- Vessel Drozlin respawn lowered to 1hr.\n- Hastened Celestial Hammer AA adjusted and re-enabled.\n- Rogue/Monk Strikethrough AA display bug fixed\n- Echo added to OoT\n- Echo added to Droga\n- Echo added to Nurga\n- A Mischievous Halfling now has Thanksgiving food and drink!\n```",
      "author": "apor1a",
      "timestamp": "2024-11-28T05:24:26.811000+00:00"
    },
    {
      "id": "1311249916022100048",
      "content": "Deployed\n```\nClient Plugin:\n- Fixed client memory leak in map\n- Targeting mobs from map is limited distance (50 units) or Line of Sight.\n- /mapfilter custom will only show mobs you can see the names of\n- You now use the highest tracking skill of anyone in your group to evaluate mobs-on-map name visibility\n\nEpics:\n- Added 2H versions of Innoruuk's Curse and Fiery Avenger.\n- Added 'Change Stance' click effect on Innoruuk's Curse and Fiery Avenger to shift between 1H and 2H forms.\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-11-27T08:39:01.825000+00:00"
    },
    {
      "id": "1310692059795034183",
      "content": "```\n- Echo added for Lake Rathe\n- Crag spiders look less human and more spider|\n- More LoY items tuned down to be between Kunark and Velious loot\n```",
      "author": "apor1a",
      "timestamp": "2024-11-25T19:42:18.536000+00:00"
    },
    {
      "id": "1310651946822013050",
      "content": "Deployed (Client Patch)\n```\n- Increased zoom-out distance (thanks @iamclint)\n- Implemented /fov command to adjust field-of-view; 45 (default) - 90 (thanks @iamclint)\n- Potentially fixed Crash-on-Zone into certain zones such as HateplaneB and Bazaar\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-11-25T17:02:54.858000+00:00"
    },
    {
      "id": "1310448565931474955",
      "content": "Deployed\n```\n- Several instantly spawnable quest NPCs are no longer attackable.\n- Cleric epic returned to primary only. This is a tradeoff for having the same proc as the level 50 summoned hammer\n- Berserker epic had stats rebalanced for Kunark/Velious era.\n- Fixed edge cases where group heals wouldn't heal pets.\n- Echo for Chardok moved inside of Chardok\n- Echo added for Warslik Woods\n- Echo added for Burning Wood\n- Echo added for Lake of Ill Omen - Echo added for Overthere\n- Echo added for South Karana\n- Respawn time reduced on a sleeping ogre\n- Respawn time reduced on Verina Tomb\n```",
      "author": "apor1a",
      "timestamp": "2024-11-25T03:34:45.075000+00:00"
    },
    {
      "id": "1309678834458562560",
      "content": "Deploying\n```\n- Corrected logical error preventing Base Crit Damage Ratio from applying\n- Temporarily disabled 1x/char AA reset on Vision of Aayonae.\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-11-23T00:36:06.791000+00:00"
    },
    {
      "id": "1309582982549602315",
      "content": "Deployed\n```\n\n- Adjusted SPA 294 (SE_CriticalSpellChance) to no longer stack its critical damage modifier, as originally intended)\n- Adjusted AA \"Destructive Fury\" to use SPA 155 (SE_SpellCritDmgIncrease) to increase critical damage directly.\n- Added AA \"Destructive Fury\" to Wizards\n- Adjusted AA \"Arcane Destructive Fury to use SPA 155 (SE_SpellCritDmgIncrease) to increase critical damage directly.\n- Reduced Crit Damage Bonus from \"Arcane Destructive Fury\" to 10% per rank \n- Adjusted Spell \"Improved Familiar\" to use SPA 155 (SE_SpellCritDmgIncrease) to increase critical damage directly.\n- Adjusted Spell \"Spirit of the Black Wolf\" to use SPA 155 (SE_SpellCritDmgIncrease) to increase critical damage directly.\n\n- Implemented 1x/char AA reset on Vision of Aayonae.\n- Implemented 1x/char free class change on Vision of Aayonae.\n\n- Fixed error preventing Melee Damage Bonus spell effects from working.\n- Being over-cap on unused AA no longer results in AA loss, only the inability to earn additional AA\n- SE_MeleeLifetap now works with Ranged and Throwing attacks\n\n- All Expedition locks have been reset.\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-11-22T18:15:13.915000+00:00"
    },
    {
      "id": "1308919463030165574",
      "content": "Implemented:\n```\n- Many AA descriptions have been updated to provide more information (thank you Alebrije!)\n- Bard aggro from songs has had its aggro reduced to 25% of its former cap.\n- Extended EXP bonus turned off.\n- Grand Master Lozz no longer speaks of Apocryphal things.\n- Kurn's Tower DZ no longer drops you in the middle of the zone (lol sorry)\n\n```\n\nPending Patch/Reboot:\n```\n- Wizard AA Improved Familiar now correctly summons a drake instead of a baby skeleton on rank 3 and 4\n- Form of the Black wolf illusion now matches Spirit of the Black Wolf duration.\n- ENC AA Mana Draw recast set on spell to match AA to avoid odd CD interactions.\n- Several Legendary items missing Heroic stats have been fixed.\n- All NPCs with a spawn time of > 1 hour, that don't have their own DZ, and are needed for epic quests have had their spawn time reduced to 1 hour.\n- The following starting cities have had these NPCs receive Parcel training!\n\n- Antonica\n(West) Freeport: Lindie Rains\nGrobb: Grallvek\nHalas: Grots\nNeriak - Commons: Lynsalai\nOggok: Klob Pulp\nRathe Mountains: Zok Malka\nRivervale: Teelie Meegles\nSouth Qeynos: Ren Pinemyer\nSurefall Glade: Grathin Nilm\n\n- Faydwer\nAkAnon: Zenrel Ottonoggin\nGreater Faydark: Merchant Vaelias\nNorthern Felwithe: Laernian Caelael\nNorth Kaladim: Marsha Stonepenner\n\n- Odus\nThe Erudin Palace: Sparlus Penfold\nPaineel: Henly Nictropus\n\n- Kunark\nEast Cabilis: Klok Faziz\n\n- Luclin\nShar Vahl: Laanas Sejiir\n\n- All Soulbinders are now immune to player damage\n- Important NPCs in EC tunnel are now immune to player damage\n```\n\nWe are planning on a reboot tomorrow morning or afternoon to bring live pending and new changes.\n\nMany good things in the works!",
      "author": "apor1a",
      "timestamp": "2024-11-20T22:18:38.534000+00:00"
    },
    {
      "id": "1308440149453049907",
      "content": "```\n- Cazel now always drops his spoon.\n- Echo of the Past now available in Kithicor.\n- Echo of the Past now available in Rathe Mountains.\n- Significantly increased performance in zones over time.\n- Sending plat via the parcel is working again! (Thank you Neckkola!)\n```",
      "author": "apor1a",
      "timestamp": "2024-11-19T14:34:01.272000+00:00"
    },
    {
      "id": "1307944944706650153",
      "content": "```\n- Pets can once again be summoned in PoSky\n- Ranger AA Precision of the Pathfinder description updated.\n- Veteran's Wrath AA description, updated.\n- Formula changed on Cinda's Charismatic Carillon and negative resist mod added\n- Echo's learn to spell better\n- Sirran will now accept key items regardless of what island he is on.\n- Spiroc Lord will now stay dead if Guardian is dead\n- Bags can now be sent through parcel (money still cannot).\n```",
      "author": "apor1a",
      "timestamp": "2024-11-18T05:46:15.260000+00:00"
    },
    {
      "id": "1307724713937862677",
      "content": "```\n- Pet illusion wands should work as expected. You may need to resummon any necro pets.```",
      "author": "catapultam_habeo",
      "timestamp": "2024-11-17T15:11:08.153000+00:00"
    },
    {
      "id": "1307433633753202742",
      "content": "Pending reboot/patch\n```\n- Monk AA Grappling Strike description corrected.\n- Monk AA Destructive Force should now work correctly.\n- Putrid Skeletons once again drop Putride Rib Bone for Monk Sash quest\n- Cazic Quill and Jagged Diamond Dagger can now be quested above their base version\n- Many misc item fixes\n- Highpass safe location no longer puts you outside the map (fixes evac in zone).\n- Wizard AA Cryomancy and Pyromancy buffs should now stack. Only one can trigger at a time.\n- Malka Rale should now spawn more often for Rogue Epic\n- Monk AA Way of Steel description corrected.\n- Greenmist SK armor has been added back to loot tables in PoFear.\n- Druid AA Nature's Guardian HP and AC increased.\n- Denise Songweaver in PoSky now expects the correct items for the Bard Test of Tone\n- Warrior AA Battle Leap description corrected\n- Grandmaster H'Qilm has had their spawn rate increased to match the rest of Hate named.\n- All Echo of the Past are now immune to all player damage.\n```",
      "author": "apor1a",
      "timestamp": "2024-11-16T19:54:29.229000+00:00"
    },
    {
      "id": "1307044028734378104",
      "content": "Pending\n```\n- Fix crash related to additional loot\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-11-15T18:06:20.154000+00:00"
    },
    {
      "id": "1306853645442224129",
      "content": "Deployed\n```\n- Attempt to fix pet illusion targeting (Cannot duplicate on test, theoretical edge case fix)\n\n- Group Incentive Program\n - In the interest of promoting sharing instances for the health of server resources...\n - Respawning Instances are now subject to the same scaling rules as Non-Respawning instances (3+ players adds to mob difficulty)\n - For each expedition member past the second;\n   - 25% stronger mobs\n   - 25% more XP\n   - 25% more AAXP\n   - 25% more item Exp\n   - 25% chance for each mob to drop an additional set of loot\n   - increased chance of legendary rolls\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-11-15T05:29:49.240000+00:00"
    },
    {
      "id": "1306665076367036507",
      "content": "Deployed\n```\n- Update to EQEmu v22.59.1\n- Fix invisible mobs (Thanks @Akkadius - you are the real MVP!)\n- Sweaty Bird Farmers rejoice - ported WFH Spiroc Island script (Thanks @Trust)\n- Added Secondary usability to Thornstinger\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-11-14T17:00:30.869000+00:00"
    },
    {
      "id": "1306393344519442453",
      "content": "Deployed\n```\n- ZEM normalized to 2.0 for zones with ZEM below 2.0\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-11-13T23:00:44.948000+00:00"
    },
    {
      "id": "1305993720575037471",
      "content": "Deployed\n```\n- Pets survive death again (frfr)\n- Parcel purchases work again\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-11-12T20:32:47.175000+00:00"
    },
    {
      "id": "1305908449619607663",
      "content": "Deployed:\n```\n- Noble Dojorn and Overseer of Air now correctly drop Efreeti War Maul\n- Bryn Fynndel now correctly accepts the Shadow Coded Book\n- Geometry updated across many zones to fix mobs falling through the world ie Fear - Thank you Trust!\n- The frequency of charm pets breaking and aggroing other mobs reduced (faction wars)\n- Players now informed why they can't pull a dz when they aren't the leader (because they aren't the leader)\n- Charm can *actually* be refreshed in combat now\n- Sanguine Mind Crystal and Azure Mind Crystal now behave well with implied targeting\n- Mojax can no longer spawn infinite Duggin Scumbers \n- Previously non-resizable windows are now resizable by default\n- Glidara Myllar now accepts Warning to Glidara\n```\n\nPending Patch/Reboot:\n```\n- Warrior AA Gut Punch description fixed\n- Certain items that had incorrect stats for their legendary versions have been fixed\n- Cleric AA Turn Undead description fixed\n```",
      "author": "apor1a",
      "timestamp": "2024-11-12T14:53:56.995000+00:00"
    },
    {
      "id": "1305393437985734676",
      "content": "Deployed \n```\n- Disabled Anti-AFK script in the Bazaar\n- Fixed Ride-Along bazaar and back targets\n- Charm spells should no longer inappropriately redirect as implied targets.\n- ZEM is applied to per-kill aaxp cap\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-11-11T04:47:28.653000+00:00"
    },
    {
      "id": "1305270536628338759",
      "content": "Deployed 11/10/24\n```\n- Additional fixes for 'Invisible Mobs' issue\n- Deployed sharding system for Bazaar (Thanks @Akkadius)\n- Misc unstream fixes\n\n- Windstriker has had its proc changed to Lightning Bolt\n- Rain Caller has had its click removed and replaced with the same spell (Firestrike) as a proc\n```\n\nNotable Known Issues\n```\n- Using the 'ride along' feature of Bazaar and Back for a group member with a different target zone will result in undefined behavior\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-11-10T20:39:06.686000+00:00"
    },
    {
      "id": "1304979313254207538",
      "content": "Hotfix 11/8/24  - This requires a fresh zone server until reboot, so only zones which have been closed for 5 mins or longer.\n```\n- Attempt to fix 'Invisible Mobs' issue\n```\n\nDeployed 11/9/24\n```\n- Tearal and Son of Tearal can now attune your Bazaar and Back ability to either Bazaar or East Commonlands, respectively.\n- Plane of Sky scripts should all work now.\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-11-10T01:21:53.623000+00:00"
    },
    {
      "id": "1304647984100806717",
      "content": "Hotfix 11/8/24 - This requires a fresh zone server until reboot, so only zones which have been closed for 5 mins or longer.\n```\n- Attempt to fix pet buffs causing periodic frame skips for some users\n```\n\nDeployed 11/9/24\n```\n- Respawning instance lockout lowered to 2 hours.\n- Mobs with respawn times longer than 2 hours will not spawn inside Respawning instances.\n- Lowered Non-respawning instance lockout to 16 hours.\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-11-09T03:25:18.597000+00:00"
    },
    {
      "id": "1303902189189857281",
      "content": "Deployed 11/7/24\n```\n- Added Disenchanted Bags\n- Charm pets will not clear inventory on refreshing charm\n- Fixed clicking off pet buffs\n- Shrink\\Grow works on pets\n- Rabid Bear moved to song window\n- Clean up pets on charm break a little better, hopefully resolving intermittent issues with hostile npc seeming to be a friendly\n- Marl Kastane should spawn for Shadowknights who need him upon entering Kerra Ridge\n- Removed Deity from all items\n- Adjusted negative stats on edge case upgraded items\n- Pets & Suspended buffs persist through death\n- Added more descriptive text to instance offer dialogue\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-11-07T02:01:47.234000+00:00"
    },
    {
      "id": "1303619142045143072",
      "content": "Deployed 11/6/24\n\n```\n- Updated to EQEmu v22.57.1\n- Mages no longer lose TEMPORARY items when logged off\n- More than 4 proc buffs can simultaneously apply (but no more than 4 will proc in any combat round)\n- Necromancers get full damage from Vampiric Embrace\n- Dragons are no longer tiny\n- Crocodiles are no longer huge\n- Spoot remains an asshole\n- Shrink and Grow, except specifically pet-targeted, no longer affects NPCs or Pets.\n- Echo of Luck works correctly for quest turn-ins.\n- Charm can be refreshed?\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-11-06T07:17:03.536000+00:00"
    },
    {
      "id": "1303530351636774976",
      "content": "```\n- Oracle of K`arnon respawn lowered to 1 hour with a 30 minute variance.\n- Sir Lucan D`Lere respawn lowered to 1 hour with a 30 minute variance.\n- Marl Kastane respawn lowered to 1 hour with a 30 minute variance.\n- Lost Iksar quest text now makes sense.\n- Cryomancy and Pyromancy description now correctly reflects that it can be used on spells below level 60.\n- Bosses once again correctly spawn inside of non-respawning instances\n- Geometry updated for several problematic zones (thanks Trust!)\n- Black Block of Ore no longer looks like a book\n- Druid spell Protection of Rock now correctly scales again\n- Enchanter spell Weakness now correctly stronger than Insipid Weakness\n- Necro AA Death Bloom had its health cost and mana regen halved per tick\n- Shaman AA Spiritual Blessing is now marked as non dispellable\n- Bard AA Funeral Dirge can no longer be resisted\n- Warrior AA Warlord’s Resurgence has had its description corrected\n- Enchanter spell Boon of the Clear Mind is now correctly tuned between C1 and C2\n- EoM Haste once again grants haste V1 and is now correctly applying\n- Echo for hate removed from Oasis\n- Apothic Kilt (Legendar) now gives correct stats\n- Echo for Runnyeye now works correctly\n- Echo added to Cazic Thule\n- BST AA Gelid Rending can now proc with any weapon\n- Cazic Thule no longer despawns under certain unintended conditions\n```\n\nSome of these are live, some of these are pending. Trying to iterate quickly to get all your reports addressed.\n\nFor a little background, things like this are not necessarily fixed in order of importance- beyond server stability and playability, every report is important.\n\nSo, when we have small amounts of time or limited capacity, we bite off little things.\n\nRest assured, our OCD will guarantee every report gets looked at 🙂",
      "author": "apor1a",
      "timestamp": "2024-11-06T01:24:14.253000+00:00"
    },
    {
      "id": "1303442945671692420",
      "content": "@here\n\n```\n- Fixed zone crashes\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-11-05T19:36:55.047000+00:00"
    },
    {
      "id": "1303422359621079101",
      "content": "Deployed\n```\n- New global buff system (Thanks @Secrets)\n- Fishing can result in Enchanted and Legendary items\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-11-05T18:15:06.950000+00:00"
    },
    {
      "id": "1303013816132440124",
      "content": "Immediate effect\n```\n- Reduced Exp from Spirocs in Plane of Sky\n- Terror, Fear, Dread, and Dracoliche no longer spawn in respawning Plane of Fear instances\n- Respawning Instances now have the same lockout DURATION as Static instances\n\n- Parcel purchase from /baz window is now free.\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-11-04T15:11:42.592000+00:00"
    },
    {
      "id": "1302710373446586460",
      "content": "Pending\n```\n- Characters who are Rangers will display their Bow as their default weapon instead of their melee weapons.\n- Discovery of Enchanted items will no longer trigger a world announcement.\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-11-03T19:05:56.218000+00:00"
    },
    {
      "id": "1302710180533899408",
      "content": "Deployed over last two days, sorry has been crazy;\n```\n- Updated Gambling Halfling text\n- Cryomancy and and Pyromancy are no longer level restricted\n- Bow Mastery fixed frfr\n- Mobs should flee when feared now\n- Charm spells should overwrite any other Charm spell cast by the same caster on the same mob.\n- Adjusted item experience gain\n  - clamped exp gain based on tier\n  - adjusted exp gain calculation\n\n- Fixed crash related to activating AAs while in a group\n- Way of Steel should now display correctly to all monk combos (please remember to patch).\n- Halfling Rogue GM text corrected.\n- Incorrectly scaled legendary items fixed (improved).\n- Certain unusable poison crafting components removed from Bazaar vendor.\n- Berserker starting weapon now *actually* a 2hander.\n- Compensating measure implemented for bugged starting quests. If you have a bugged starting quest from last night, please remove the quest, relog, go to the fading memory in bazaar, and say \"note\", then proceed with the quest.\n- EoM buffs disappearing under certain circumstances has been resolved.\n- Item leveling appearing to pause at certain points has been resolved.\n- Fixed crash related to moving bag contents\n\n- Fixed memory leak related to loading AA information\n```\n\nKnown major issues\n```\n- Item leveling does not work as anticipated via kill-exp. Consuming does work as expected.\n- Bazaar is VERY slow when local population over 100\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-11-03T19:05:10.224000+00:00"
    },
    {
      "id": "1302321345014534207",
      "content": "Pending on fresh zone servers\n```\n- Fixed crash related to moving bag contents\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-11-02T17:20:04.612000+00:00"
    },
    {
      "id": "1302291165894152242",
      "content": "Deployed\n\n```\n- Way of Steel should now display correctly to all monk combos (please remember to patch).\n- Halfling Rogue GM text corrected.\n- Incorrectly scaled legendary items fixed (improved).\n- Certain unusable poison crafting components removed from Bazaar vendor.\n- Berserker starting weapon now *actually* a 2hander.\n- Compensating measure implemented for bugged starting quests. If you have a bugged starting quest from last night, please remove the quest, relog, go to the fading memory in bazaar, and say \"note\", then proceed with the quest.\n- EoM buffs disappearing under certain circumstances has been resolved.\n- Item leveling appearing to pause at certain points has been resolved.\n```",
      "author": "apor1a",
      "timestamp": "2024-11-02T15:20:09.349000+00:00"
    },
    {
      "id": "1302287329112756244",
      "content": "Pending\n```\n- Updated Gambling Halfling text\n- Cryomancy and and Pyromancy are no longer level restricted\n- Bow Mastery fixed frfr\n- Mobs should flee when feared now\n- Charm spells should overwrite any other Charm spell cast by the same caster on the same mob.\n- Adjusted item experience gain\n  - clamped exp gain based on tier\n  - adjusted exp gain calculation\n\n- Fixed crash related to activating AAs while in a group\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-11-02T15:04:54.589000+00:00"
    },
    {
      "id": "1302047213064683530",
      "content": "Deployed 11/1/24.\n\nWelcome to Release.\n\n```\n- Added #tim (Toggle Improved Models). Use this command to disable upgraded NPC models if you hate fun.\n- Non-Bards can no longer interrupt spell casting by clicking the gem multiple times.\n\nClass Removal\n- Vision of Ayonae now requires EoM to remove a class, and has a 7-day initial cooldown. This cooldown will increase by 7 days, permanently, each time it is used on a character.\n- When removing a class, invalid skills are also removed.\n\nAbilities\n- Improved Frenzy damage scaling based on Primary Weapon\n- Improved damage from Way of Steel\n- Druid AA Nature's Guardian has had its CD reduced for ranks 5 and 6.\n- Ranger AA Bow Mastery works as intended again.\n- Lifetap spells can once again crit heal\n\nMisc\n- Re-Introduced and fixed 'Hunter' titles\n- Item Discovery Broadcasts should filter under 'Experience Messages'\n- Custom bazaar NPCs can no longer be mistakenly attacked.\n- Fear now causes NPCs to flee again\n- Megosh Thistlethorn is back in game but with OoE scripts stripped\n- Some quests have had their components/items made lore again.\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-11-01T23:10:46.462000+00:00"
    },
    {
      "id": "1301593922492956733",
      "content": "Deployed\n\n```\n- Removing class correctly removes spells\n- AAXP settings preserved on zone\n- Project Illusion works on all pets\n- EoM cost reduced from 5 to 2 for The Mischievous Halfling and the Purveyor of Glamour.\n- Death tip now correctly reflects gameplay on THJ.\n- New friends added to the campfire.\n- Updated website.\n- Dragon Trigger in Skyfire no longer incorrectly attacks players\n- AA cap for white mobs increased to 6%\n- AA scale blue, light blue, and green mobs slightly increased\n- Fixes for memory leaks around item improvement and pets (@Secrets)\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-10-31T17:09:33.568000+00:00"
    },
    {
      "id": "1301273391797506099",
      "content": "Deployed\n```\n- EoM cost reduced from 5 to 2 for The Mischievous Halfling and the Purveyor of Glamour.\n- Death tip now correctly reflects gameplay on THJ.\n- New friends added to the campfire.\n- Updated website.\n- Dragon Trigger in Skyfire no longer incorrectly attacks players\n- AA cap for white mobs increased to 6%\n- AA scale blue, light blue, and green mobs slightly increased\n```",
      "author": "apor1a",
      "timestamp": "2024-10-30T19:55:53.095000+00:00"
    },
    {
      "id": "1301255542051831931",
      "content": "Pending\n```\n- Removing class correctly removes spells\n- AAXP settings preserved on zone\n- Project Illusion works on all pets\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-10-30T18:44:57.384000+00:00"
    },
    {
      "id": "1300929901423231056",
      "content": "Deployed\n```\n- Fixed some NPC quest text\n- Fixed charm breaks\n- Fixed Way of Steel (Nerfed Monks)\n- Added additional starting port locations\n- Charm spells can be refreshed\n- Reduced some annoying noises (@Mith) (REMOVED)\n- Autofire\\throw can be used while casting bard songs\n- Guild Management Window now shows correct classes\n- Lifetaps can once again critically heal\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-10-29T21:10:58.608000+00:00"
    },
    {
      "id": "1300605985504624640",
      "content": "Deployed\n```\n- Implemented per-kill AAEXP cap which is informed by: con of mob, level of player. Exp Rate buffs increase this cap.\n- Decreased amount of exp needed to improve items to (Enchanted)\n- Pet inventory and buffs no longer fade on zone (@Secrets)\n- Marsingers 3\\4 require Kunark to be unlocked\n- Removing classes should now correctly store changes to player profile\n- Echo of the Brood now has a small spell haste component\n- All auto granted starting AA now have an AA cost of 0 to allow players to progress total AA count at the same rate.\n- Cleric now starts with Purify Soul AA instead of Twincast AA\n- Purify Soul is now a 15 minute CD\n- Druid now starts with Entrap instead of Paralytic Spores\n- Druid and Necromancer no longer start with Critical Affliction AA\n- Druid, Necromancer, Enchanter, and Shaman now begin with an innate 3% chance to crit with DoTs\n- Enchanter and Shaman now also start with the Destructive Cascade AA\n- Shooting a bow/throwing things now levels Offense (thank you Carolus)\n- Spell crit chance and bonus now stack correctly (thank you Grek)\n- Players no longer autojoin deprecated channels. General, OOC, and AUC are now the preferred global channels (thank you Trust)\n- Support, Bug, and LFG channels are now available to new players that join Discord by default\n- Warrior and Berserker starting quest item adjusted.\n- Bard Discipline Deftdance has had its base CD reduced and now has Hastened AA available\n- Updated Consume Item AA description\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-10-28T23:43:51.035000+00:00"
    },
    {
      "id": "1300170230915534848",
      "content": "Deployed\n```\n- All auto granted starting AA now have an AA cost of 0 to allow players to progress total AA count at the same rate.\n- Cleric now starts with Purify Soul AA instead of Twincast AA\n- Purify Soul is now a 15 minute CD\n- Druid now starts with Entrap instead of Paralytic Spores\n- Druid and Necromancer no longer start with Critical Affliction AA\n- Druid, Necromancer, Enchanter, and Shaman now begin with an innate 3% chance to crit with DoTs\n- Enchanter and Shaman now also start with the Destructive Cascade AA\n- Shooting a bow/throwing things now levels Offense (thank you Carolus)\n- Spell crit chance and bonus now stack correctly (thank you Grek)\n- Players no longer autojoin deprecated channels. General, OOC, and AUC are now the preferred global channels (thank you Trust)\n- Support, Bug, and LFG channels are now available to new players that join Discord by default\n- Warrior and Berserker starting quest item adjusted.\n- Bard Discipline Deftdance has had its base CD reduced and now has Hastened AA available\n- Updated Consume Item AA description\n```",
      "author": "apor1a",
      "timestamp": "2024-10-27T18:52:19.045000+00:00"
    },
    {
      "id": "1299609834563440670",
      "content": "Deployed\n\n```\n- Assassinate can now trigger at level 50\n- Buffs that effect spell critical damage should now stack\n- Hitting level 50 will now automatically grant one class AA\n- Main task updated to require level 50 instead of 51\n- Weirdness fixed around Echo of the Brood server buff\n- Dreadlands Echo is no longer... in places other than Dreadlands <_<\n- Fists of Steel renamed to Way of Steel. Way of Steel procs off kicks/strikes and also increases the damage of kicks and strikes the same way Fists of Steel increased h2h damage. Way of Steel does not increase h2h damage.\n```",
      "author": "apor1a",
      "timestamp": "2024-10-26T05:45:30.143000+00:00"
    },
    {
      "id": "1299074291568082975",
      "content": "working log; all pending\n```\n- Added a short lockout to Respawning instances (1 hour)\n- Added Hand of the Gods proc to cleric epic\n- Power Source item improvement rate calculation is now always based on the top-tier version of the item, then scaled down for lower tiers.\n- Fixed Rage Volley casting animation\n- Discs now correctly start their timers when activated while casting.\n- Fixed spell haste display\n- Fixed melee mitigation effect on pets\n- Enabled AAEXP at level 1\n- Reduced max level during classic to 50\n- Echo buffs now scale by level more appropriately.\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-10-24T18:17:26.743000+00:00"
    },
    {
      "id": "1299068357512790077",
      "content": "```\n- Frenzied Burnout AA cost reduced to 3/6/9/12/12/12\n- Elemental Earth AA no longer exploitable for massive HoT\n- NPC Melee Interrupts reduced\n- Sarkis Ebonblade now talks to Shadowknights as intended\n```",
      "author": "apor1a",
      "timestamp": "2024-10-24T17:53:51.954000+00:00"
    },
    {
      "id": "1298551768585605191",
      "content": "```\n- Removed all lockouts from respawning instances\n- Raid\\Flag bosses no longer spawn in respawning instances\n- Non-Respawning instances will become more difficult based on the number of players above 2 in an expedition.\n- Players may no longer be added to an expedition once the progression flag mob spawns.\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-10-23T07:41:07.556000+00:00"
    },
    {
      "id": "1298343309261013104",
      "content": "Deployed\n\n```\n- Many Hate 2.0 and OoE items available in classic have been reduced to bring them in line with progression expectations.\n- Many LoY and OoE items available in Kunark have been reduced to bring them in line with progression expectations.\n- More AA/Spell description corrections.\n- Backstab damage from non-1hp sources has been reduced.\n- Corrected map files for Hate, The Hole, Gunthak, Nadox, Veksar, and Sebilis have been added to the patcher.\n\n```",
      "author": "apor1a",
      "timestamp": "2024-10-22T17:52:46.980000+00:00"
    },
    {
      "id": "1297301475860414606",
      "content": "```\n- Pet buffs that include mitigation can no longer be dispelled.\n- Blur of Axes base damage increase has been reduced.\n- Tearel can now interact with players that are invis/hidden/SoS.\n- Prince Selrach Di'zok has had his stun component removed. Blind lasts up to 24 seconds.\n- Sneak Attack description fixed.\n- RoRZ description fixed.\n- Notlav the Scalekeeper no longer spawns.\n- Minor VP 1.0 fixes.\n- Trickster's Calling reduced to 10s\n```\n**Important Note:**\n\nInnoruuk in Hate has been changed similarly to the Dragons in VP 2.0.\n\nLoot has been changed to the original (Post Revamp) version 1.5. His difficulty has been reduced in kind. All of his revamped loot can now be worn by any race.",
      "author": "apor1a",
      "timestamp": "2024-10-19T20:52:54.541000+00:00"
    },
    {
      "id": "1295934257541283881",
      "content": "```\n- Scout Malom now correctly spawns The Spirit of Torment.\n```",
      "author": "Retribution EQ #change-log#0000",
      "timestamp": "2024-10-16T02:20:04.292000+00:00"
    },
    {
      "id": "1295116943312818217",
      "content": "```\n- Glidara Myllar script fixed.\n- Bryn Fynndel script fixed.\n- Orc Impaler quest should now be completable.\n- Mojax Hikspin script fixed.\n- Enchanter slow cast times reduced to match comparable Shaman slow cast times. This effects: Tepid Deeds, Shiftless Deeds, Forlorn Deeds, Dreary Deeds, and Desolate Deeds.\n- Echo of the Past added to Crushbone\n- Echo of the Past added to Befallen\n- Echo of the Past added to Kurn's Tower\n- Echo of the Past added to Runnyeye\n- Echo of the Past added to The Warrens\n- Echo of the Past added to Blackburrow\n- Echo of the Past added to Sol A\n- Echo of the Past added to Upper Guk\n- Monk Disciplines Voiddance and Whirlwind have had their base CD reduced to 28 minutes from 40.\n- Echo of the Past for Dreadlands has been moved to its port in spot.\n\n```\n\n**Important Note:**\n\nIt has been decided that VP 2.0 launching with Kunark is a poor overall experience for a number of reasons.\n\nVP moving forward will drop 1.0 loot and its bosses will be scaled back to fit in between Kunark progression targets and Velious dragons. They will keep most of their mechanics but the effects and stats have been reduced by about 60%.\n\nThis should make it feel like an end game Kunark experience, and with the availability of Enchanted/Legendary gear, still worth doing in era.\n\nThe mobs and abilities may be adjusted further.",
      "author": "apor1a",
      "timestamp": "2024-10-13T20:12:21.395000+00:00"
    },
    {
      "id": "1294787699277959189",
      "content": "Pending Reboot\n\n```\n- Waypoint added to Lake Rathe\n- Black Insanity and Dark Courage weapons have had their bane damage increased on each version.\n- Inscribable Words ground spawn fixed in Nagafen's Lair.\n- Spawn location of Avisiris has been corrected.\n- Gliblixl Rocktok now sells starter Bard Instruments in the bazaar.\n- Philter of Translocation now properly labeled Philter of Major Translocation\n```",
      "author": "apor1a",
      "timestamp": "2024-10-12T22:24:03.500000+00:00"
    },
    {
      "id": "1294369641543762014",
      "content": "```\n- Experimental fix for the noloot\\nocast bug\n- Misc bug fixes\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-10-11T18:42:50.769000+00:00"
    },
    {
      "id": "1293714261134278699",
      "content": "```\n* Vision of Ayonae added to Bazaar\n - For characters with exactly 1 class, the Vision can add two random classes.\n - For characters with more than 1 class, the Vision can remove a class. This removal has a cost in EOM and a cooldown.\n   - Cooldown set to 1 day and EoM cost to 0 for Beta\n   - All skills, spells, disciplines, and AA which are unusable after the class drop are deleted.\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-10-09T23:18:35.903000+00:00"
    },
    {
      "id": "1293597206405840899",
      "content": "```\n* Players are immune to stun for a short time after being Stunned\n* Increased the amount of allowed movement while casting spells\n* Instant-cast Disciplines can be used while casting\n* Disciplines with casting time will interrupt spellcasting.\n* Fixed pet buffs randomly not working based on resummoning pets, etc\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-10-09T15:33:27.881000+00:00"
    },
    {
      "id": "1293592147341082697",
      "content": "```\n* Lowered Damage on Sympathetic Strike I-III\n* Sacrificial Dagger adjusted to Sympathetic Strike II\n* Black Tome with Silver Runes adjusted to Sympathetic Strike III\n\n* Twincast will no longer apply to most procs\n* Calliav\\Prism Skin type runes provide immunity to DS while active, and DS hits do not burn their charges.\n```",
      "author": "Retribution EQ #change-log#0000",
      "timestamp": "2024-10-09T15:13:21.706000+00:00"
    },
    {
      "id": "1293346133531430913",
      "content": "```\n* Classes eligible to buy an AA are now listed in the AA Description\n* Removed low-level bonus to item leveling, now solely based on con of kill and stats on item\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-10-08T22:55:47.443000+00:00"
    },
    {
      "id": "1293076847604535327",
      "content": "```\n* Item Exp actually takes item stats into account.\n* Ranged Attacks can skill up DA\\TA\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-10-08T05:05:44.675000+00:00"
    },
    {
      "id": "1293037243723939890",
      "content": "```\n* DD spell cast times reduced to 3 seconds if above 3 seconds, Any time reduced this way added to recast times.\n* Cast times on spell inspect window are now correct, and correctly account for Spell Haste.\n* Spell Cast bar will still end 'early' when Spell Haste is in effect.\n* Archery and Throwing weapons now check Double and Triple Attack skills\n* Fixed PBAoE being limited to 4 targets\n* Adjusted item leveling so that item stats is weighted over character level\n* EoM Exp AND Loot buffs apply to item leveling rate\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-10-08T02:28:22.374000+00:00"
    },
    {
      "id": "1292338022649561121",
      "content": "```Cabilis, Lake of Ill Omen, Warsliks Woods, Swamp of No Hope, Field of Bone, Kurn's Tower, Shar Vahl, Shadeweaver's Thicket, Hollowshade Moor, and Paludal Caverns are all now available in classic.```",
      "author": "Retribution EQ #change-log#0000",
      "timestamp": "2024-10-06T04:09:55.079000+00:00"
    },
    {
      "id": "1292298737808445541",
      "content": "```\n- Added Tutorial Popups for; Welcome, Buff Suspending, Power Source\\Upgraded Items, Sympathetic Procs\n- Added two newbie tasks that helps guide the player from level 1->51, introduce key concepts and faciliate Kunark unlock\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-10-06T01:33:48.843000+00:00"
    },
    {
      "id": "1291141623316615188",
      "content": "```\n- Swarm pets created by pets now belong to that pet's owner.\n- Items upgraded via power source can no longer trigger Discovery events.\n- Items upgrading via power source will no longer gain any significant exp while in a raid.\n- #mystats now dumps all pet info at once, regardless of target\n- default UI elements for Player and Group windows are now non-resizable, and can be moved more intuitively.\n- Pet Commands other than /pet attack and /pet back are issued ONLY to your focused pet (the one which has the pet window)\n- Added additional stages to Power Source exp reports.\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-10-02T20:55:51.250000+00:00"
    },
    {
      "id": "1290694483100569703",
      "content": "```\n- Restored vanilla timers to discs\n- Discs assigned to multiple classes use original timer IDs\n- Discs assigned to individual classes use a class-unique set of timer IDs\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-10-01T15:19:04.715000+00:00"
    },
    {
      "id": "1290575831361523777",
      "content": "```\n- Added support for up to 500 disc timers\n- All discs on seperate timers (This will change!)\n- Reworked custom skill timers to reduce packet traffic by at least 100x\n- Static instances are now generated dynamicly\n- All of the above patch\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-10-01T07:27:35.936000+00:00"
    },
    {
      "id": "1290078652939112509",
      "content": "Pending Patch:\n\n```\n- Iron Oxide spawns fixed in Steamfont Mountains.\n- SH Casino (Therin Asakith) now properly rewards all illusion items\n- Lambent Boots, Gaunts, and Greaves quest turn ins have been fixed\n- Staff of Writhing proc rate has been fixed across all versions\n- Satchel of the Hero is now no drop and has 100% WR\n- Gnome Warrior GM, Narron Jenork has returned and once again offers his Watchman Boots quest\n- Ranger AA Protection of the Spirit Wolf CD reduced to 15 minutes\n- Plane of Sky quest Test of Preparation fixed\n- Lower Guk WP move from Safe Hall to Undead Side Entrance\n- Jboots click effect changed for Lego version!\n- Spirit of Cheetah recast time lowered to 3 minutes\n- Swarm Pet Mistwalker HP increased to 600\n- Clarified description on Paladin's Blessing of Light AA\n- Shaman AA Rabid Bear now gives double attack/regen/cold resist at rank 1. These stats and proc chance have been lowered across Rk 2 and 3.\n- Cleric AA Divine Avatar now gives higher stats at lower ranks but has had its effect cap reduced on max ranks.\n```",
      "author": "apor1a",
      "timestamp": "2024-09-29T22:31:59.363000+00:00"
    },
    {
      "id": "1288893446676807752",
      "content": "PENDING\n\n```\n* Added Beastlord and Berserker to a number of old-world items which were missing them\n* Reduced aggro transfer from taunt-off pets to owner\n* Consume Item will no longer delete items as they become Legendary\n* Improved NPC Model Upgrade routines\n  - Fixed Wolf Models\n* Racial skills add to skillcaps\n* Improved skill-up messages (shows current/cap)\n* Fixed access to #myskills\n* Fixed access to #mystats\n* Reduced CD of Bestial Alignment\n* SE_MeleeLifetap applies to SpecialAttackDamage\n* Fixed containers for 'Strike of Shissar N' poisons\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-09-26T16:02:24.170000+00:00"
    },
    {
      "id": "1288338475724312656",
      "content": "```\n* EoM Loot Buff increases Item XP rate\n* Mobs will IGNORE pets which have pet taunt off; all aggro the pet would have generated is transferred to their owner.\n* Pet AoEs now work without the pet having aggro on each mob individually first.\n* Legendary Augments are no longer attuneable.\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-09-25T03:17:08.784000+00:00"
    },
    {
      "id": "1288303500970692668",
      "content": "```\n* Fixed infinity buff stacking from non-class sources\n* Fixed crash bug\n* Fixed attune-on-exp bouncing\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-09-25T00:58:10.153000+00:00"
    },
    {
      "id": "1287917817815109632",
      "content": "```\n* Fixed Bard foci (again)\n* Legendary items are once again Attuneable\n* Attuneable items become no-drop when you gain experience with them equipped, rather than immediately upon equip.\n* Fixed pet target HoTT\n* Fixed per commands breaking if you have a familiar as first pet\n* Fixed familiars attacking if you have something other than a familiar as first pet\n* Improved coherency of pet window swapping\n* Fixed losing access to pet window if charm pet was focused pet when it died\\charm broke\n* Buff stacking is bypassed for spells you cast against other buffs you cast which don't share a class\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-09-23T23:25:36.123000+00:00"
    },
    {
      "id": "1287147068732997703",
      "content": "```\n* Only Must-Equip clickies will become attuned when clicking from inventory\n* Numerous quest script fixes\n* Honey, I shrunk the bats.\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-09-21T20:22:55.222000+00:00"
    },
    {
      "id": "1286425410141290609",
      "content": "```\n- Fixed Disc Timers\n- Totally nuked all traces of LDON camps\n- Lost track of bug fixes.\n- FD should no longer cure debuffs\n- Pet debuffs should be removed on resting, skipping ones cast by their owner to faciliate charm.\n- Pet bag and multiple pets plays nice now\n- Project Illusion now works on Pets.\n- Fixed BS with non-1hp damage\n- Power Source no longer applies stats.\n- Improved stacking of proc spells (multi-class proc spells will stack)\n- Improved stacking of DS (multi-class DS will stick, but not every DS from same class)\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-09-19T20:35:18.406000+00:00"
    },
    {
      "id": "1286236109008797730",
      "content": "Pending Patch\n\n```\n- Instruments now display their correct Resonance level based on item tier.\n- Tier 1 and 2 items are always magical.\n- Bard Epic instrument effect corrected\n- Fixed Bash reuse timer w\\ haste\n- Fixed clockwork summons\n- Fixed wizard sword\\cleric hammers\n- Added Beastlord and Berserker to a number of old-world items which were missing them\n- Reduced CD of Bestial Alignment\n- SE_MeleeLifetap applies to SpecialAttackDamage\n- Fixed containers for 'Strike of Shissar N' poisons\n```",
      "author": "Retribution EQ #change-log#0000",
      "timestamp": "2024-09-19T08:03:05.499000+00:00"
    },
    {
      "id": "1286022083201208392",
      "content": "```\n* Restored Fury of Magic, Spell Casting Fury, Destructive Fury to Hybrids\n* (Ingenuity was never removed)\n* Ingenuity now works as described - it ONLY affects spells from items (Procs, Clicks)\n* Return to the Valley Beneath the Son of Fixing Power Source Dupes\n* Removed several duplicated AA\n* Adjusted client validation so that it does not boot players from Bazaar, and gives more info on how to get correct client.\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-09-18T17:52:37.770000+00:00"
    },
    {
      "id": "1285646038744567849",
      "content": "```\n* Hopefully fixed power source dupe (again again)\n* Removed Fury of Magic AA from Hybrids again\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-09-17T16:58:21.785000+00:00"
    },
    {
      "id": "1285383939115978868",
      "content": "```\n* Clickies become attuned when successfully clicked.\n* Fixed power source upgrading from duping items (for real this time)\n* Mandatory 0.5s recast removed Beneficial instant-clicks.\n* Exclude Pacify and Mez from Cascade of Decay\n* Pets will taunt undead mobs now (?!)\n* All Weapon Proc (SPA 85) spells stack\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-09-16T23:36:52.364000+00:00"
    },
    {
      "id": "1285072099698016303",
      "content": "Pending Patch\n\n```\nTrueshot Discipline increased hit chance was broken. It has been fixed (0 to 12%).\n\nBerserker Discs - Head Strike, Leg Strike, Leg Cut, Head Pummel, Head Crush, Divertive Strike, and Distracting Strike, have had their reagent requirements removed. They also now share a CD with Throw Stone.\n\nBerserker Disc Focused Fury increased hit chance was broken. It has been fixed (0 to 50%).\n\nWarrior Disc Precision increased hit chance was broken. It has been fixed (0 to 50%).\n\nMonk Discs - Phantom Wind, Zephyr, Echo, and Call now share a CD with Throw Stone\n```",
      "author": "Retribution EQ #change-log#0000",
      "timestamp": "2024-09-16T02:57:44.053000+00:00"
    },
    {
      "id": "1284796823336259585",
      "content": "```\n* Hole door is now 'click to enter' instead of being a literal door\n```",
      "author": "Retribution EQ #change-log#0000",
      "timestamp": "2024-09-15T08:43:53.054000+00:00"
    },
    {
      "id": "1284767213877854229",
      "content": "```\n* Fix dupe when upgrading items with power source\n* Low-level characters get a multiplier on power source leveling rate.\n* Unresistable spells are actually unresistable\n* Short-Duration buffs no longer zone with pet.\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-09-15T06:46:13.609000+00:00"
    },
    {
      "id": "1284649224260292678",
      "content": "```\nHell levels removed for real this time.\n```",
      "author": "apor1a",
      "timestamp": "2024-09-14T22:57:22.692000+00:00"
    },
    {
      "id": "1284637798019633182",
      "content": "Pending Patch\n\n```\nEnchanter AA Phantasmic Reflex has been changed. ALL SPELLS cast by an enchanter, now have a SMALL chance to grant the caster SMALL rune.\n\nLegendary Staff of Writhing and Legendary Ancient Prismatic Staff now have had their proc restored in addition to their click.\n```",
      "author": "Retribution EQ #change-log#0000",
      "timestamp": "2024-09-14T22:11:58.464000+00:00"
    },
    {
      "id": "1284366282204123227",
      "content": "```\n* Attempt to resolve issues with power source upgrading to legendary\n* Reduced floor on legendary experience scalar for item upgrading\n* AA Abilities now use implied targeting\n* Spirit of Cheetah moved to short duration buff box\n* Combat Mana\\HP\\Endurance Regeneration is now displayed the actual value from the server.\n* Resists now display the actual value on the server\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-09-14T04:13:04.049000+00:00"
    },
    {
      "id": "1284232804883890287",
      "content": "```\n* Druid DS now scales correctly\n* Fixed several issues surrounding being unable to manipulate inventory while casting. \n* Expected behavior\\Please test the following specifically;\n  - Inventory, Hotkeys, Skills, etc should be usable while casting\n  - Spell casting messages (for self and other) should be created correctly.\n  - Spell interrupt messages should be created correctly.\n  - Bard Song interrupt messages should be created correctly (no cast messages for Bard Songs)\n  - Monk alt-appearance gear should use unique graphics\n```\n\nPATCH REQUIRED",
      "author": "catapultam_habeo",
      "timestamp": "2024-09-13T19:22:40.576000+00:00"
    },
    {
      "id": "1283931437963149325",
      "content": "```\n* Debuffs now clear automatically when ending combat\n* Fixed bug causing 'You are weakened and cannot rest' to display inappropriately.\n* Rogues can backstab with any weapon\n* Cleaned up casting and interrupt messages (THIS WAS ACTUALLY REALLY CLEVER GUYS)\n* There is now a minimum time between activating Bandolier sets (10 seconds).\n* Monk skill attacks now trigger Fists of Steel proc (but not damage)\n* Added Situational Awareness AA - Increases Tracking skill by 10 points per rank.\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-09-12T23:25:09.103000+00:00"
    },
    {
      "id": "1282507287625469994",
      "content": "```\n- Detrimental spells now stack with beneficial spells.\n  - ie; If you have SoW and get Snared, your run speed is now SoW speed minus the Snare reduction\n- Short Duration spells (Song Window) no longer have stacking conflicts with normal buffs.\n- If somehow a short duration buff overwrites a long duration buff, or vis versa, they will go to the correct window.\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-09-09T01:06:05.203000+00:00"
    },
    {
      "id": "1281396861147676696",
      "content": "```\nSpirit of the Howler Pet level increased.\nNature Walker's Behest Pet HP reduced.\nTorturing Winds Debuff reduced to 2 minutes from 2 hours.\n```",
      "author": "Retribution EQ #change-log#0000",
      "timestamp": "2024-09-05T23:33:38.900000+00:00"
    },
    {
      "id": "1280206113660473560",
      "content": "```\n- Deleted several RC and Apoc 'tradeskill tools'\n- Quests which check for the presence of items now correctly detect when those items are in the bottom two slots of inventory.\n_ Clockwork Bankers and Merchants now work again, and are no longer 'pets'.\n_ Mage Epic pet is affected by pet focus items once again\n- Tearel should be more reliable\n_ AHR now triggers correctly when all other bosses in zone are dead.\n- AHR spawn conditions survives zone reset.\n- Thylex of Veeshan is far less talkative\n- Fixed SoL-completion Bag Upgrade\n```",
      "author": "Retribution EQ #change-log#0000",
      "timestamp": "2024-09-02T16:42:02.576000+00:00"
    },
    {
      "id": "1280040224138727529",
      "content": "```\nEffective now:\n\nremains of Vah Kerrath no longer randomly eats Soul Essences\n\nNE Tower in Sanctus Seru now has working teleporters\n\nLuclin BST pet has slightly increased base stats and now correctly benefits from PP20 gauntlets from VT\n\nOn reboot:\n\nCertain ranger selfbuff procs that were unable to proc from archery, now proc from archery\n\nCertain item clickies no longer require reagents\n\nGroup ports now work again when players are in an instance\n```",
      "author": "Retribution EQ #change-log#0000",
      "timestamp": "2024-09-02T05:42:51.432000+00:00"
    },
    {
      "id": "1279089267922178139",
      "content": "Effective on reboot:\n\n```\nLockpicking requirement from SSRA doors has been removed.\nKey items are still required.\nCertain bags have had their capacity slightly increased on RC/Apoc versions\nZerker AA Tireless Sprint now correctly increases movement rank by 10% for RKII and RKIII\nRangers once again have access to the Shield Block AA\nVeteran's Wrath AA once again effects all weapon types (certain weapon types were not benefitting from this AA as intended since the normalization- this has been fixed).\nRanger spells Flaming Arrow and Burning Arrow now correctly proc Symp Strikes. Their base damage has been decreased but now act as short DoTs.\nMonks now have access to three ranks of the Hastened Destructive Force AA\nMonks now have access to four ranks of the Hastened Defensive Poses AA\nGliblixl Rocktok no longer spawns in the Bazaar\n```",
      "author": "Retribution EQ #change-log#0000",
      "timestamp": "2024-08-30T14:44:05.802000+00:00"
    },
    {
      "id": "1278501238148960351",
      "content": "```\n- Can consume higher-tier items (reg in PS, consume enchanted).\n- attempt to fix pet taunt\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-08-28T23:47:28.579000+00:00"
    },
    {
      "id": "1278227086808715314",
      "content": "```\nItem Experience Rework (Again)\n- Using your Power Source slot to progress an item no longer carries an experience penalty.\n- Any item which receives experience becomes no-drop immediately.\n- Reworked scaling rates;\n  - Rates vary based on item tier, con-level of kill, current level, and total stats of the item.\n  - Higher con differences = more item progression\n  - Lower current level = more item progression\n  - Normal -> Enchanted = less progression required\n  - Enchanted -> Legendary = MUCH more progression required\n  - More total stats = more progression required\n - Re-implemented Consume Item\n  - Still maps to the 4x for normal->enchanted, 4/8x for enchanted -> legendary.\n  - No-Drop items MAY NOT be consumed (It was this or break the ratio above to prevent cheese).\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-08-28T05:38:05.806000+00:00"
    },
    {
      "id": "1277511372816519231",
      "content": "```\nReworked Item Experience\n- Not sharing a lot here, figure this one out yourselves.\n- This one is way better.\n- Items become no-drop as soon as you feed them XP.\n- Ok, fine. It's con and level based, totally independent of item stats. Relatively easy to get to enchanted, significantly harder to get legendary.\n- Harder at higher levels, but you can kill faster, so... evaluate that how you want.\n- Removed exact % feedback for leveling rate.\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-08-26T06:14:06.293000+00:00"
    },
    {
      "id": "1276746251861229568",
      "content": "8/23 - Pending Reboot\n```\n* Items which gain a click upon being upgraded to Legendary no longer have 0 charges.\n* Charmed pets no longer consume a pet slot after charm breaks\n* Glyph AAs can no longer be purchased.\n* Skill reuse times fixed (finally), Thanks @Carolus\n* Familiars no longer spawn a pet.\n* Spell Procs (Poison, buffs, AA, etc) work with ranged and throwing attacks\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-08-24T03:33:47.242000+00:00"
    },
    {
      "id": "1276566684332851331",
      "content": "```\n* Autoinventory now skips Power Source and Ammo\n* Refromatted /who results\n* Updated Description and names of Dire Charm variants to distinguish allowed targets.\n* Updates/Fixes to Melee Skill reuse timers\n* Knight's Advantage stacks now\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-08-23T15:40:15.007000+00:00"
    },
    {
      "id": "1276243407290761216",
      "content": "```\n* Implemented Client<->Server handshaking. You will be disconnected after a short period of time if you are not using the client modification plugin.\n* Implemented improved MQ2 detection. \n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-08-22T18:15:39.754000+00:00"
    },
    {
      "id": "1276194813896822829",
      "content": "```\nEffective on reboot, some effective immediately:\n\n- Banded armor can be combined again.\n- Every quest in Jaggedpine now gives the correct faction.\n- Klandicar now gives the correct faction.\n- Phara Dar now heals to full if disengaged and depops his adds.\n- Ella Foodcrafter now lets players know she has [two tasks].\n- Circlet of the Falinkan quest now requires correct level to complete (kindly down from ally).\n```",
      "author": "Retribution EQ #change-log#0000",
      "timestamp": "2024-08-22T15:02:34.186000+00:00"
    },
    {
      "id": "1276101765921509417",
      "content": "```\n* Lots of progress on cleaning up /who. Apparently I don't remember exactly how /rol and /anon work. More to come\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-08-22T08:52:49.820000+00:00"
    },
    {
      "id": "1276052667470188625",
      "content": "Running changelog for next patch\n```\n* Items upgraded via Power Source will retain charges.\n* Fixed skillcaps problems, including 2HP\n* Level 1 Skills set to cap for that level (Except tradeskills, etc). Skills displayed at level 1 are fucked, don't try to make sense of them.\n* First point in new skills is automatically assigned at level-up.\n* Revert to vanilla stacking logic, hopefully clears up weird song stacking stuff.\n* Fixed not being able to trade your pets no-drop items.\n* Fixed typos\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-08-22T05:37:43.837000+00:00"
    },
    {
      "id": "1275678617942228993",
      "content": "Round 2!\n```\n* Dimensional Armory will selectively equip mage pets.\n* Pets can be traded items again\n* Fixed invulnerable monks\n* FoS limited to H2H again\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-08-21T04:51:23.480000+00:00"
    },
    {
      "id": "1275637372138295417",
      "content": "Consolidated Patch.\n```\n* Cleric summoned hammers are no-drop.\n* Pets no longer accept no-drop items given to them by anyone other than their owner.\n* Add sliding cap on how much exp can be earned per kill; variable on both player level and con color\n* Fixed Fists of Steel\n* Multipet Version 2:\n - Primary\\Secondary pet distinction is gone\n - Summon or Charm in any order\n - One pet per originating class;\n   - One Mage summon or charm\n   - One Enchanter summon or charm\n   - One Necromancer summon or charm\n   - etc\n - Targeting pet switches pet window\n - Pet commands with a pet targeted send command only to that pet\n - /pet qattack - sends one pet at a time\n - Pets will be forced into Ext Target slots 18, 19, 20\n* Death no longer results in exp loss.\n* Lowered base Exp rate by a moderate amount\n* Increased group size exp penalty\n* Increased Item Exp rates by a moderate amount\n* Hell Levels removed\n\nHot-Fix (may need new zone server!)\n* Tab\\F8 should no longer target pets.\n* Reverted H2H-only limit on FoS for now.\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-08-21T02:07:29.714000+00:00"
    },
    {
      "id": "1275628398600785940",
      "content": "```\nEffective immediately:\n\n- With the decrease of overall exp gain, hell levels have been removed.\n\n- Exp loss on death has also now been removed.\n```",
      "author": "apor1a",
      "timestamp": "2024-08-21T01:31:50.256000+00:00"
    },
    {
      "id": "1275278018083815468",
      "content": "```\nNext Patch:\n* Cleric summoned hammers are no-drop.\n* Pets no longer accept no-drop items given to them by anyone other than their owner.\n* Add sliding cap on how much exp can be earned per kill; variable on both player level and con color\n* Fixed Fists of Steel\n* Multipet Version 2:\n - Primary\\Secondary pet distinction is gone\n - Summon or Charm in any order\n - One per per originating class;\n   - One Mage summon or charm\n   - One Enchanter summon or charm\n   - One Necromancer summon or charm\n   - etc\n - Targeting pet switches pet window\n - Pet commands with a pet targeted send command only to that pet\n - /pet qattack - sends one pet at a time\n - Pets will be forced into Ext Target slots 18, 19, 20\n* Death no longer results in exp loss.\n\nHotfix:\n* Lowered base Exp rate by a moderate amount\n* Increased group size exp penalty\n* Increased Item Exp rates by a moderate amount\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-08-20T02:19:33.031000+00:00"
    },
    {
      "id": "1275275502965362720",
      "content": "```\nNext Patch:\n* Mage Summoned items modified as follows;\n  - Staff of Tracing: Symp Strike I -> Burn (1s/30s)\n  - Staff of Warding: Symp Strike II -> Cancel Magic (1s/30s)\n  - Staff of Runes: Symp Strike III -> Symp Strike I (1s/30s)\n  - Staff of Symbols: Symp Strike IV -> Ward of Calliav (1s/30s)\n\n  - Dagger: Burn -> Burst of Flame\n  - Snake Fang: Poison -> Weak Poison\n  - Spear of Warding: Rune I (unchanged)\n  - Sword of Runes: Rune II (Unchanged)\n  - Dagger of Symbols: Shock of Flame -> Shock of Blades\n\n* Apocryphal Fire Crystal Staff: Sympathetic Strike V -> Sympathetic Strike III\n* Blur of Axes damage is now scaled based on level.\n```",
      "author": "Retribution EQ #change-log#0000",
      "timestamp": "2024-08-20T02:09:33.380000+00:00"
    },
    {
      "id": "1274855094273310810",
      "content": "```\nHateplaneb is now fixed\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-08-18T22:19:00.137000+00:00"
    },
    {
      "id": "1274778415710470184",
      "content": "```\nHotfix:\n\nVulak is no longer rooted in place. It is highly recommended you pull him off his platform before engaging. Unless, of course, you enjoy lava.\n```",
      "author": "Retribution EQ #change-log#0000",
      "timestamp": "2024-08-18T17:14:18.543000+00:00"
    },
    {
      "id": "1274465896978448579",
      "content": "```\nHotfix:\n* Haste now applies to combat skills again. (Should fix timer bugs)\n```",
      "author": "Retribution EQ #change-log#0000",
      "timestamp": "2024-08-17T20:32:28.271000+00:00"
    },
    {
      "id": "1274023304469942294",
      "content": "```\n* Fury of Magic is no longer available to hybrids\n* Fists of Steel no longer applies to 1HB weapons\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-08-16T15:13:45.994000+00:00"
    },
    {
      "id": "1273891017434726481",
      "content": "```\n* Combat Fury normalized for all classes which normally obtain it. Now applies to all weapon skills (Rangers, it now works for archery).\n* Veteran's Wrath normalized for all classes\n* Mastery of the Past is now fully available to all spellcasting classes\n* Shield Block is fully available to all classes able to equip shields\n* Spell Casting Subtlety is now fully available to call spellcasting classes\n\nHotfix:\n* Fixed bug preventing rogue from using SoS (Only effective in reloaded zones until reboot)\n* Fixed bug around combat fury being a pre-req for other AA\n```",
      "author": "Retribution EQ #change-log#0000",
      "timestamp": "2024-08-16T06:28:06.307000+00:00"
    },
    {
      "id": "1273377641671430257",
      "content": "```\n* Bazaar and Back will now place you in a semi-random place in the Bazaar\n* Bazaar and Back will now prompt nearby group members if they want to travel with you. (beepboops can use /yes to accept it) (thanks @Chroma)\n* Pets should no longer be unshrinkable monstrosities\n* Pet names are now static (Parsers rejoice)\n* Revamped pet names\n```",
      "author": "Retribution EQ #change-log#0000",
      "timestamp": "2024-08-14T20:28:07.987000+00:00"
    },
    {
      "id": "1273152817099706388",
      "content": "```\nTearel Overhaul\n\nTearel now allows you to attune the map to any destination you have previously discovered.\nHe can now also attune the map to your current expedition, but like group ports it takes special reagents (EoM).\nUnlocking group ports or expedition attunements will unlock both.\nIf you already unlocked group ports, you may now use Tearel to return to your active expedition.\n```",
      "author": "Retribution EQ #change-log#0000",
      "timestamp": "2024-08-14T05:34:45.632000+00:00"
    },
    {
      "id": "1272971478454898777",
      "content": "**Consolidated Change Log**\n*Note:* Some of these changes already went live, but all of them will be live on reboot.\n\n```\n- Mage Epic now correctly impacted by Pet Power 15\n- Monster Summoning III now impacted by Pet Power 15\n- Zumaik's Animation  now impacted by Pet Power 15\n- Spirit of Khurenz stats increased to be in line with Pet Power 15 pets of other classes.\n- Emissary of Thule now has an appropriate Pet Power 15 pet.\n- Throwing Axes now stack to 100\n- Sentry Badain now lets you know the 10th ring war is being worked on and returns your items.\n- Enchanter Epic NPC Nadia Starfeast now summons the Enchanter's Sack on turn-in as well as a phrase for those following different guides.\n- Bristlebane's Mischievous Mayhem should now be correctly casting every 48 seconds (up from 30).\n- GoD quests accidentally enabled by allowing VP 2.0 have had their rewards scaled down instead of removed. If you paid plat for these items and no longer want them, DM me for a refund (Hoshkar and Xygoz quests).\n- All Manastone qualities have been set back to a 1-second cast for this season. This may change in future seasons.\n- Throw Stone no longer shares a CD with other major skills.\n- Explosion of Spite, Beacon of the Righteous, and Area Taunt have had their range increased to 60. This is an increase of 10, 30, and 20 range respectively.\n- Group leadership AA requires 100 Dark Blue kills per point.\n- Raid leadership AA requires 50 Dark Blue kills per point.\n- All poison vendors in the bazaar have had their faction removed.\n- Progression NPCs \"A Faded Memory\" now see through invis, hide, and improved invis.\n- Many item stat changes from the king-me channel.\n- Ranger AA Frost Arrows has had its damage increased to match Flaming Arrows. Its mana cost per tick has been removed.\n- Ranger AA Flaming Arrows has had its mana cost removed.\n- Ranger spells Flaming Arrow (Not the AA) and Burning Arrow now apply a called shots effect, increasing archery damage taken by 10 and 20% for 3 ticks.\n- Ranger AA Trick Shot occurrence increased to 5% per rank.\n- Spell: Trickster's Calling has had it's duration reduced to 20 seconds.\n- Crown of Rile has had its original click effect restored - Extinguish Fatigue, restoring Endurance instead of Stamina.\n- Druid spell Nature Walker's Behest has had the durability of its pet increased (not its damage).\n\n```",
      "author": "Retribution EQ #change-log#0000",
      "timestamp": "2024-08-13T17:34:11.130000+00:00"
    },
    {
      "id": "1271660020295270425",
      "content": "```\n* Tinkering is available to any race\n* Shamans can perform Alchemy\n* Rogues can perform Poison Making\n* Rogue Sneak\\Hide now functions as anticipated\n* Melee Combat Skills (Kick, Bash, Kick(s), Strike(s), Frenzy) are all on seperate cooldowns\n* Human and Iksar Monks will correctly display Cured Silk type armors.\n* Fixed HoTT showing incorrect HP for yourself.\n* AA abilities with recasts shorter than their duration will now suspend\n* Item EXP to powersource now consumes a portion instead of all exp.\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-08-10T02:42:55.139000+00:00"
    },
    {
      "id": "1271499064210362481",
      "content": "```\n* Added the ability to consume items to add exp to the item in your power source.\n  - Must be from the same upgrade series at a lower stage\n  - Same step are worth 25% exp\n  - One step lower are worth 6.25% exp\n* Secondary pets now accept equipment traded to them\n* Secondary pets now respond to pet commands\n  - /pet qattack now sends pet attack command to one pet at a time, in a cycle\n* 4 ranks of Mnemonic Retention are granted on character creation.\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-08-09T16:03:20.218000+00:00"
    },
    {
      "id": "1271105399537537064",
      "content": "Hot-Fix\n```\n* Fixed zone server crash when handing items to charmed pets.\n* Attempt at fixing certain mobs from summoning you under the world.\n```",
      "author": "Retribution EQ #change-log#0000",
      "timestamp": "2024-08-08T13:59:03.246000+00:00"
    },
    {
      "id": "1270428849955405916",
      "content": "8/06/2024\nConsolidated Changelog - Deploying\n```\nRetribution has migrated to new server infrastructure, located centrally in a Chicago datacenter.\n\nBug Fixes:\n* Improved Implied Targeting - Characters should no longer nuke themselves when a mob dies before their spell lands\n* Bard Spellbars should lock\\unlock as anticipated\n* Experimental fix for spellbar remaining locked under unknown condition\n* Both Players and Pets should display Ornaments as anticipated\n* IP limit checkks are once again ignored in the Bazaar. Reminder; you are expected to only play a maximum of 3 characters at a time. The hard limit is not enforced at 3, but please do not abuse this grace.\n* Vulak should now reliabily spawn. In addition, Thylex of Veeshan will occasionally shout a hint as to which trigger mobs remain up.\n* Jaled Dar's Shade should now stop Douging.\n* Magician epic pet should now be affected by pet foci again.\n* Experimental fix for hotbars occasionally being rearranged\n\nImprovements:\n* First Orb of Retribution now also scales based on the farthest progression stage which this account has unlocked this season.\n* Rod of Mystical Transvergence conversion ratio enhanced\n* Azure Mind Crystals are now a targeted summon\n* Sanguine Mind Crysals are now a targeted summon\n* Bazaar vendor Augments are now all\\all and pri\\sec\\range\n* Removed need for locking on doors to Chardok Royals.\n\nEoM Services:\n* The Polymorphist in the Bazaar now has Drakkin as a race-change option.\n* The Purveyor of Glamour has a SIGNIFICANTLY higher chance of awarding an 'interesting' random augment\n```\n\nPost-Patch\n```\n* Allaclone and CharBrowser now function correctly.\n```",
      "author": "Retribution EQ #change-log#0000",
      "timestamp": "2024-08-06T17:10:41.256000+00:00"
    },
    {
      "id": "1270068579076935785",
      "content": "8/05/2024\n```\n* Reworked NTOV script to spawn Vulak\n* Removed lockpicking requirement from Chardok Royals\n```",
      "author": "Retribution EQ #change-log#0000",
      "timestamp": "2024-08-05T17:19:05.985000+00:00"
    },
    {
      "id": "1269763708481962027",
      "content": "08/04/2024\n\nAll of this probably needs a reboot to be fully effective. Next reboot scheduled for DT on Tuesday.\n```\n* Reverted anti-idle script in Bazaar\n* Azure Mind Crystal is now a targeted summon (target receives item)\n* Sanguine Mind Crystal is now a targeted summon (target receives item)\n* Bazaar vendor weapon augments are now all/all pri/sec/range\n* Sympathetic Procs should no longer reflect back at their owner\n```",
      "author": "Retribution EQ #change-log#0000",
      "timestamp": "2024-08-04T21:07:39.171000+00:00"
    },
    {
      "id": "1269450676338167808",
      "content": "08/03/2024\nImmediate or Immediate-ish (new zone servers)\n```\n* Characters who are AFK\\Idle for more than 10 minutes in the Bazaar and not Traders will be phased into a private instance. They will return to the public instance once they are no longer idle.\n* Improved Implied Targeting\n* Improved Bard spellbar refresh handling (maybe not perfect still)\n* Aggressively unlock spellbar for classes other than Bard (Working on action-lock bug)\n* First Orb of Retribution now has extra scaling based on progression stages unlocked.\n* Pets use Ornaments again\n* The Polymorphist will now help you become a Drakkin\n* The Purveyor of Glamour has a significantly higher chance of giving you a random ornament that is cool, for some definition of cool.\n* Player Ornaments work without re-equipping gear.\n```\n\nNext Reboot:\n```\n* Characters in the Bazaar are once again immune to IP limit checks\n* Modulating Rod and Rod of Mystical Transvergence conversion rate increased\n```",
      "author": "Retribution EQ #change-log#0000",
      "timestamp": "2024-08-04T00:23:46.492000+00:00"
    },
    {
      "id": "1269065307331493943",
      "content": "**Adventurers**, *the time has come to brace yourselves for the icy challenges that lie ahead! The mystic land of Velious, long shrouded in legend and mystery, now calls to the bravest of Norrath's heroes.\n\nVelious, the frozen continent, is a land of ancient secrets and formidable foes. Here, the towering ice-bound peaks and treacherous glaciers conceal forgotten dungeons, majestic dragon lairs, and the remnants of the great Coldain dwarves. The legendary giants of Kael Drakkel, the enigmatic dragons of the Temple of Veeshan, and the resilient Coldain dwarves await those bold enough to explore this frigid frontier.\n\nPrepare your weapons, gather your allies, and steel your hearts against the biting cold. The journey through Velious will test your strength, courage, and resolve like never before. Will you rise to the challenge and uncover the hidden treasures and untold stories of this icy realm? The fate of Velious lies in your hands!\n\nWelcome to Velious, where glory and peril are but a heartbeat away. Step forth, and let the adventure begin!*\n\n**Patch Notes:**\n```\nWhen the server comes back up, all pending changes will come live, and addition to:\n\n- Pets will now move behind mobs when not tanking\n- Adjusted pet follow behavior\n- Spells against Pets will now use their owner's resists in addition to their own\n- Removed door to Plane of Mischief in Great Divide\n- Manifest Elements is no longer granted as part of Mage Epic quest, and is removed from spellbooks\n- Dire Charm now calculates 'light blue' correctly.\n- Bard Song, Jonthan's Inspiration now has a self only proc component.\n- Our beloved magic map is back with new functionality coming soon!\n- LoY now releasing with Velious... \n```\n\nA HUGE thank you to all our donators, contributors, and active community members! We are having a blast and love that you are too!\n\nWe prepared a special treat for you... **LoY launches with Velious launch today!**\n\nAdditionally, as we continue to grow, we have decided to normalize non emergency downtime to Tuesdays. So that everyone can better plan 👍 \n\nThanks to your contributions, this Tuesday we will be migrating to new hardware in a more centralized location! \n\nEvery week, Retribution gets better, thank you for being here!\n\nHave fun tonight!",
      "author": "Retribution EQ #change-log#0000",
      "timestamp": "2024-08-02T22:52:27.361000+00:00"
    },
    {
      "id": "1268648098918567937",
      "content": "```\nPending Patch/Reboot\n- BST pets Zehkes, Khurenz, and Khati Sha have had their levels and HP adjusted\n- BRD Epic can now be equipped in the range slot\n- Echo of Memory added to Plane of Mischief ahead of Velious launch\n- More Gods now give The God Slayer title.\n```",
      "author": "Retribution EQ #change-log#0000",
      "timestamp": "2024-08-01T19:14:37.124000+00:00"
    },
    {
      "id": "1268578766473527470",
      "content": "```\n* Added Multiple Pet functionality\n - First pet Summoned or Charmed is 'Primary Pet' and is controlled via Pet Window\n - Subsequent pets may be Summoned as Secondary Pets\n   - Up to 2 Secondary pets may be Summoned\n   - Charmed pets may not be Secondary Pets\n   - Secondary Pets do not get their own pet control windows, but will obey the following commands\n     - /pet attack\n     - /pet back off\n     - /pet hold\n     - /pet ghold\n   - Beneficial spells affecting the Primary Pet will mirrored on any Secondary Pets\n   - Secondary Pets Cannot:\n    - Utilize a pet bag\n    - Zone with their owner \n - Only one Pet per class may be summoned. (ie, a SHM/NEC/WAR may summon a Shaman spirit and a Necromancer pet, but not two Necromancer Pets)\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-08-01T14:39:06.981000+00:00"
    },
    {
      "id": "1264807693298962432",
      "content": "```\nPending Patch:\n\nAll World Buffs now correctly count down when in Bazaar.\nHoly Elixir once again stacks with other HoTs\n```",
      "author": "Retribution EQ #change-log#0000",
      "timestamp": "2024-07-22T04:54:13.073000+00:00"
    },
    {
      "id": "1264518059532750898",
      "content": "Rolling Next Update Changelog...\n```\n- Echo of Luck now guarantees Apocryphal rewards for quests\n- Sympathetic Proc buffs now actually 16hr duration\n- Sympathetic Procs can trigger even if the spell cannot apply to a mob (ie, Symp Heal can proc even if the buff was blocked)\n- ST_SummonedPet handled correctly be implied targeting. (Petamorph wands)\n- Bards are no longer compelled to sing forever.\n- Fixed Berserkers not hitting more than 1x with Frenzy\n- Fixed Froglok Beastlord warders.\n- Familiar spells will no longer dismiss other types of pets when they fade.\n- Ikaav's Venom now has a spell icon.\n\n# Augmentation Overhaul #\n- Augment Slots standardized across all items, into the following types;\n   - Type 1 (Stats): All equippable items have at least one of these slots. Augs with only stats will fit into these slots.\n   - Type 2 (Worn): Equippable items without a focus or worn effect will have one of these slots. Augs wih a Focus or Worn effect, along with Type 1 augs, will fit in these slots.\n   - Type 3 (Spells): Currently unused.\n   - Type 4 (Procs): All Weapons have at least one of these slots. Augs with Procs, Damage, Bane Damage, Elemental Damage, or Type 3 augments will fit in these slots.\n   - Type 20 (Ornament): All PRI\\SEC\\RANGE items will have one of these slots for statless ornaments.\n   - Type 21 (Ornament): All Visible Slot equipment will have these slots (Currently unused).\n   - Two-Handed weapons have an additional Type 1 and Type 4 slot compared to 1-handed items.\n\n- This should provide additional coherence to augment itemization, remove the relatively meaningless type 7\\8 split, allow for items without foci\\worn effects to be a little more valuable, and provide a much-needed boost to two-handed weapons.\n- Any augments in slots which are no longer valid will be ejected from items when this gets deployed, and will need to be reinserted.\n\n** THJ ONLY**\n- (THJ) AA can be activated while casting\n- (THJ) Items can be augmented even if it would result in an item that you can no longer use\n- (THJ) Fixed Archery procs.\n- (THJ) Fixed Reyfin Malakwa for Multiclass characters\n- (THJ) Items upgraded to Legendary via Power Source now correctly show as attuned.\n- (THJ) Legendary items may no longer be equipped in Power Source, and Enchanted->Legendary upgrades will eject the item from the Power Source instead of infinitely soaking XP\n** THJ ONLY**\n```",
      "author": "Retribution EQ #change-log#0000",
      "timestamp": "2024-07-21T09:43:19.002000+00:00"
    },
    {
      "id": "1264297691672743948",
      "content": "```\n- Actually, for sure, definitely, REALLY fixed Eejag this time\n- Phara Dar's adds should now aggro correctly.\n```",
      "author": "Retribution EQ #change-log#0000",
      "timestamp": "2024-07-20T19:07:39.210000+00:00"
    },
    {
      "id": "1263912204261134387",
      "content": "Immediate Effect:\n```\n- Low-AA bonus increased to 400%. At 0AA, you will recieve a 4x bonus to AAXP, decreasing linearly until a total of 300AA have been earned\n```",
      "author": "Retribution EQ #change-log#0000",
      "timestamp": "2024-07-19T17:35:51.849000+00:00"
    },
    {
      "id": "1263752537756930080",
      "content": "Pending Next Reboot\\Patch\n```\n- Echo of Luck now guarantees Apocryphal rewards for quests\n- Sympathetic Proc buffs now actually 16hr duration\n- Sympathetic Procs can trigger even if the spell cannot apply to a mob (ie, Symp Heal can proc even if the buff was blocked)\n- ST_SummonedPet handled correctly be implied targeting.\n- Bards are no longer compelled to sing forever.\n```",
      "author": "Retribution EQ #change-log#0000",
      "timestamp": "2024-07-19T07:01:24.388000+00:00"
    },
    {
      "id": "1263652317794930688",
      "content": "Consolidated Changelog:\n\n```\n- Help Baelin quest fixed.\n- Battle Master Ska`tu loot tables fixed.\n- Shaman Cudgel quest 6 fixed.\n- Howling Stone final key fixed.\n- Silver Wand and silvered guard fixed.\n- Eejag now spawns where that impudent sprite is.\n- Rage of Zomm and Dyzil's Deafening Decoy work once again.\n- SK Viscious Bite of Chaos recourse now stacks with Lich instead of overwrites.\n- Priest of Najena now correctly always drops Tarnished Bronze Key\n- The Undertake Lord once again has a name.\n- The Skeletal Sepulcher once again has a name.\n- Spell: Invigor has been removed from all merchants.\n- Ragebringer proc has had it's radius reduced.\n- Robe of Living Fungus now has HP Regen again.\n- The following rogue abilities may now be used in combat:\n    Rogue Abilities Sneak Attack (20)\n    Thief's Vengeance (52)\n    Assassin's Strike (63)\n    Kyv Strike (65)\n    Ancient Chaos Strike (65)\n    Daggerfall (69) \n    Razorarc (70)\n\n- 'Must Equip' items can be cast from inventory if they are attuned\n\n- Sympathetic Strike of Flames replaced with Sympathetic Strike\n- All Sympathetic 'Strike-like' abilities replaced with Sympathetic Strike\n  - Prismatic Resist (average resist of target)\n  - Partial resists enabled\n  - 16h duration, undispellable\n  - Triggers on EVERY cast (same as healing), stacks with all similar abilities, such as the Pyromancy AA from wizards\n\n- Sympathetic Healing Burst replaced with Sympathetic Healing\n - 16h duration, undispellable\n\n- Ground spawns are now present in non-respawning DZ\n- Swarm pets will aggro everything that has their owner on its hate list\n- Certain quests which check for the presence of an item in your inventory will work correctly with RC\\Apoc items\n\n- Inventory data is now sent in the seconds following a zone transition, instead of during the zone. This is intended to mitigate crash-on-zone issues.\nIF YOU ENTER A ZONE AND HAVE AN EMPTY INVENTORY, ZONE BACK OUT IMMEDIATELY AND REPORT IT AS A BUG BY TAGGING A GM. Your items are safe as long as you don't manipulate your inventory while it is empty.\n\n\nAA Exp Scaling has been enabled for the first 300AA.\nThis means there is a 200% AA exp bonus for your first AA that scales down as you approach 300. At 300 AA, this bonus goes away.\nThis change is meant to aid: players catching up, alts, and classes that take higher AA investments to come into their own.\nThis bonus stacks with the server wide EXP bonus.\n```",
      "author": "Retribution EQ #change-log#0000",
      "timestamp": "2024-07-19T00:23:10.087000+00:00"
    },
    {
      "id": "1263523992602546348",
      "content": "Pending Reboot:\n```\n* Fixed and re-enabled AAXP Scaling based on total earned AA\n* Symp proc durations reduced to 16h from Permanent\n```",
      "author": "Retribution EQ #change-log#0000",
      "timestamp": "2024-07-18T15:53:14.977000+00:00"
    },
    {
      "id": "1263354038532182178",
      "content": "```\nAA Exp Scaling has been enabled for the first 300AA.\n\nThis means there is a 200% AA exp bonus for your first AA that scales down as you approach 300. At 300 AA, this bonus goes away.\n\nThis change is meant to aid: players catching up, alts, and classes that take higher AA investments to come into their own.\n\nThis bonus stacks with the server wide EXP bonus.\n```\nEdit: Temporarily Reverted.\n\nNecromancer AA Soul Seeker CD reduction reduced to 2 minutes per rank. Leaving max rank LB at 5 minutes. Please do not pretend you though LB was supposed to have no CD. Thanks.",
      "author": "Retribution EQ #change-log#0000",
      "timestamp": "2024-07-18T04:37:54.769000+00:00"
    },
    {
      "id": "1263233303608164353",
      "content": "Still pending reboot:\n```- 'Must Equip' items can be cast from inventory if they are attuned\n\n- Sympathetic Strike of Flames replaced with Sympathetic Strike\n- All Sympathetic 'Strike-like' abilities replaced with Sympathetic Strike\n  - Prismatic Resist (average resist of target)\n  - Partial resists enabled\n  - 16h duration, undispellable\n  - Triggers on EVERY cast (same as healing), stacks with all similar abilities, such as the Pyromancy AA from wizards\n\n- Sympathetic Healing Burst replaced with Sympathetic Healing\n - 16h duration, undispellable\n\n\n- Ground spawns are now present in non-respawning DZ\n- Swarm pets will aggro everything that has their owner on its hate list\n- Certain quests which check for the presence of an item in your inventory will work correctly with RC\\Apoc items```",
      "author": "Retribution EQ #change-log#0000",
      "timestamp": "2024-07-17T20:38:09.320000+00:00"
    },
    {
      "id": "1263204566200221839",
      "content": "```\nPending Reboot:\n\n- Help Baelin quest fixed.\n- Battle Master Ska`tu loot tables fixed.\n- Shaman Cudgel quest 6 fixed.\n- Howling Stone final key fixed.\n- Silver Wand and silvered guard fixed.\n- Eejag now spawns where that impudent sprite is.\n- Rage of Zomm and Dyzil's Deafening Decoy work once again.\n- SK Viscious Bite of Chaos recourse now stacks with Lich instead of overwrites.\n- Priest of Najena now correctly always drops Tarnished Bronze Key\n- The Undertake Lord once again has a name.\n- The Skeletal Sepulcher once again has a name.\n- Spell: Invigor has been removed from all merchants.\n- Ragebringer proc has had it's radius reduced.\n- Robe of Living Fungus now has HP Regen again.\n- The following rogue abilities may now be used in combat:\n\nRogue Abilities Sneak Attack (20)\nThief's Vengeance (52)\nAssassin's Strike (63)\nKyv Strike (65)\nAncient Chaos Strike (65)\nDaggerfall (69) \nRazorarc (70)\n\n```",
      "author": "Retribution EQ #change-log#0000",
      "timestamp": "2024-07-17T18:43:57.788000+00:00"
    },
    {
      "id": "1262828889718390885",
      "content": "Immediate Effect:\n```\n- Parcels are now available.\n- Various merchants associated with the League of Antonican Bards can send\\recieve Parcels\n- Mysterious Mailman added to Bazaar\n- Bazaar purchases via Parcel are now enabled\n```",
      "author": "Retribution EQ #change-log#0000",
      "timestamp": "2024-07-16T17:51:09.535000+00:00"
    },
    {
      "id": "1262772314844565504",
      "content": "(Next Reboot)\n```\n- Heroic Charisma is now applied as a direct resist adjustment to spells. (ie; 67 HCha is -67 additional resist check to all spells)\n- Improved mob pathfinding\n```",
      "author": "Retribution EQ #change-log#0000",
      "timestamp": "2024-07-16T14:06:21.034000+00:00"
    },
    {
      "id": "1262638983905804308",
      "content": "```\nPending Patch:\nRage of Rallos Zek AA - Endurance Cost Reduced by 1/4\n\nKey requirements in Seb have been removed\n```",
      "author": "Retribution EQ #change-log#0000",
      "timestamp": "2024-07-16T05:16:32.461000+00:00"
    },
    {
      "id": "1262519984828055644",
      "content": "Working through these right now, post in the related suggestion thread if you have any in particular you want to get hit. (https://discord.com/channels/1019251428637814874/1242512903136083968)\n```\n* The following spells have separated illusion and benefit components.\n- Elemental Form: Air\n- Elemental Form: Water\n- Elemental Form: Fire\n- Elemental Form: Earth\n- Form of the Bear\n- Form of the Great Bear\n- Boon of the Garou\n- Trickster's Augmentation\n- Wolf Form\n- Greater Wolf Form\n- Share Wolf Form\n- Form of the Great Wolf\n- Share Form of the Great Wolf\n- Form of the Howler\n- Form of the Hunter\n- Feral Form\n- Spirit of the Black Wolf\n- Spirit of the White Wolf\n- Visage of the Dark Arachnid\n\n* Added Vial of Prismatic Dye to possible rewards from 'A Mischievous Halfling'.\n* Tradeskilled Poisons now stack to 100\n* Tradeskilled Poisons with more than one 'hit charge' now have unlimited 'hit charges'\n* Frenzied Burnout rank 2->6 are now available at level 51\n```",
      "author": "Retribution EQ #change-log#0000",
      "timestamp": "2024-07-15T21:23:40.870000+00:00"
    },
    {
      "id": "1262263403842633804",
      "content": "```\n* GlobalLoad updated (requires client patch)\n* New Beastlord Warders\n * Human - Puma\n * Erudite - Kobold\n * Wood Elf - Green Drake\n * High Elf - Blue Drake\n * Dark Elf - Black Drake\n * Half Elf - Red Drake\n * Dwarf - Goblin\n * Halfling - Snake\n * Gnome - Junk Beast\n * Froglok - Sporali\n * Drakkin - Gold Drake\n* Disabled mob summoning players who are already in melee range\n```",
      "author": "Retribution EQ #change-log#0000",
      "timestamp": "2024-07-15T04:24:07.196000+00:00"
    },
    {
      "id": "1262158250791534674",
      "content": "Pending Patch/Reboot\n\n```\nMage Epic pet now summons at lvl 58, up from 52.\nMage Water/Fire/Air/Earth pet (lvl 60 cast) with PP 10 now summons at level 58, down from 60.\nVeksar ZEM increased to 2.0\nAll splitpaw respawn times have been corrected down to 10.5 minute spawns.\nKing-me cleaned up\nMisc Upstream Bug fixes from upgrading to new binaries\nMANY random crash fixes\n\n/bazaar now functions! (Parceling does not yet work).\n```",
      "author": "Retribution EQ #change-log#0000",
      "timestamp": "2024-07-14T21:26:16.755000+00:00"
    },
    {
      "id": "1261703391629938810",
      "content": "Pending Reboot:\n```\nAll Beastlord's now have their own racial pets again. Pets added:\n\nHuman - Puma\nFroglok - Fungusman\nDark Elf - Black Widow\nGnome - Junkbeast\nDwarf - Green Goblin\nHalfling - Bixie\nHigh Elf - Fairy\nErudite - Kobold\nHalf Elf - Giant Bat\nWood Elf - Wasp\n\nWorlace now offers key Poison Making ingredients and has been joined by his cohorts Chryssa and Dolley. Rogues- yes you shoud be making poisons.\n\nMany Misc Bug Fixes\n```",
      "author": "Retribution EQ #change-log#0000",
      "timestamp": "2024-07-13T15:18:49.880000+00:00"
    },
    {
      "id": "1261435868669808662",
      "content": "```\n- Removed the cost of most starting AA\n- Added Group Shrink to Beastlord auto-grant AA\n- All classes with pets now get auto-grant Summon Companion\n- All classes with pets or charm now get auto-grant Pet Affinity\n- Mage 'Companion's Fury' auto-grant replaced with 'Elemental Fury'\n- Lay on Hands is now auto-granted as it becomes available through level 50\n- Harm Touch is now auto-granted as it becomes available through level 50\n- Archery Mastery is now auto-granted as it becomes available through level 50\n```",
      "author": "Retribution EQ #change-log#0000",
      "timestamp": "2024-07-12T21:35:47.436000+00:00"
    },
    {
      "id": "1261218240906919977",
      "content": "Extra stuff for Kunark\n```\n- Replaced the level 51 Mage Seasonal AA.\n- Replaced Companion of Necessity with Dimensional Armory. Summons a 10-slot, Lore, No-Drop, (Not Temporary) 100% WR container. Any items placed inside this container will be automatically equipped by your summoned pets.\n- Pets will now properly proc augments and display ornaments.\n- (Summoned) Pet base damage is now influenced by the weapons they are wielding.\n\n- Some auto-granted AA had their costs removed. This may cause your total AA spend count to go down. Expect to see more of this in the future.\n```",
      "author": "Retribution EQ #change-log#0000",
      "timestamp": "2024-07-12T07:11:00.934000+00:00"
    },
    {
      "id": "1260981600993284190",
      "content": "Pending Patch/Reboot:\n\n```\nBeacon of Loathing now correctly has an RC and Apoc counterpart.\nRanger AA Ranged Finesse no longer displays incorrectly.\nCleric AA Celestial Regeneration now stacks with their regular HoT lines.\nZerker AA Cascading Rage no longer slows you and correctly gives haste instead.\nEcho of Luck and Echo of Focus can no longer be dispelled.\nRogue AA Seized Opportunity is now auto-granted at level 1 with maximum effectiveness.\nRogue AA Virulent Venom has had its first and second-rank costs reduced.\nRogues can now purchase an upgraded version of the Strikethrough AA.\nRogue AA Massive Strike base damage increased from 30 to 35.\nRogue AA Massive Strike Rk II is now available.\nMonks now start with RK I of Killing Spree like all other pure melee.\nRanger AA Precision of the Pathfinder now affects Archery accuracy but at a reduced rate.\nGift of Mana now correctly shows its effect from level 30-70 spells.\n\n```\n\n**Kunark Launch time changed to 7PM EST, 6PM CST,  due to RL conflicts.** Spread the word.",
      "author": "Retribution EQ #change-log#0000",
      "timestamp": "2024-07-11T15:30:41.582000+00:00"
    },
    {
      "id": "1260963856692285571",
      "content": "```\n- Mobs will no longer respawn at 22hr in Non-Respawning instances (to coincide with increased dz lifetimes)\n```",
      "author": "Retribution EQ #change-log#0000",
      "timestamp": "2024-07-11T14:20:11.011000+00:00"
    },
    {
      "id": "1260840422658277490",
      "content": "```\n- Temporary pet combat messages should now be visible.\n- Pet names for temporary pets, familiars, etc are a bit more descriptive\n```",
      "author": "Retribution EQ #change-log#0000",
      "timestamp": "2024-07-11T06:09:42.044000+00:00"
    },
    {
      "id": "1260793098468986932",
      "content": "```\n- 'Unlocking' (Even if still time-locked) Velious now allows bypass of key requirement for Veeshan's Peak.\n- 'Unlocking' (Even if still time-locked) Planes of Power now allows bypass of key requirement for Vex Thal.\n```",
      "author": "Retribution EQ #change-log#0000",
      "timestamp": "2024-07-11T03:01:39.078000+00:00"
    },
    {
      "id": "1260793093314183179",
      "content": "```\n- Sage of Anachronism can now expand your hole(s)\n- Sage of Anachronism will replace lost First Orb of Retribution\n```",
      "author": "Retribution EQ #change-log#0000",
      "timestamp": "2024-07-11T03:01:37.849000+00:00"
    },
    {
      "id": "1260793044303613973",
      "content": "```\n- Pet taunt will now enable them to peel off of players.\n- Pets will now taunt any mob attacking their owner during their taunt cycle, even if that is not the mob they are currently attacking.\n```",
      "author": "Retribution EQ #change-log#0000",
      "timestamp": "2024-07-11T03:01:26.164000+00:00"
    },
    {
      "id": "1260056954194366534",
      "content": "```\n- You will now recieve a notification when Echo of Luck or Seasonal status upgrades a quest reward.\n- You will now recieve an upgrade when Seasonal status upgrades a loot reward.\n- Really fixed Staff of Forbidden Rites charges.\n```",
      "author": "Retribution EQ #change-log#0000",
      "timestamp": "2024-07-09T02:16:28.606000+00:00"
    },
    {
      "id": "1260042653442117735",
      "content": "On next patch:\n```\n- Echo of the Past added to The Howling Stones\n- Zerker AA Decap has had its damage reduced\n- Echo of the Past added to ChardokB\n- Echo of the Past added to Veksar\n- VP 2.0, ChardokB, and Veksar have had their items scaled down in anticipation of Kunark launch. VP 2.0 was done with the intent that end game Velious gear (NToV) outpaces it in most scenarios.\n```\nFor those of you new to the server,  balance changes are ongoing, both buffs and nerfs will happen to outliers. I try to lean toward buffs for others instead of nerfs for the one- but outliers have to be handled.",
      "author": "Retribution EQ #change-log#0000",
      "timestamp": "2024-07-09T01:19:39.041000+00:00"
    },
    {
      "id": "1259187477865037886",
      "content": "Rebooting to bring live pending changes as well as:\n```\n- Enchanters gain access to Bite of Tashani AA\n- Sky weapon efreeti standard is now magic\n- Summon Companion AA now available to Druids\n- Sky quest rewards that were later swapped for better versions have now been swapped for their better versions.\n- Inny no longer depops.\n- Berserker AA Untamed Rage now correctly adds haste instead of subtracts.\n- Several misc bugs/suggestions/king-mes completed.\n- Magician Fire/Stone/Ice/Vapor Core AA cooldown reduced to 15min\n- Charges on Staff of Forbidden Rites have been normalized and no longer scale with quality (Each version now has 50).\n- Charm crashing zones *should* be fixed.\n```\nThank you all for being here! Server buffs going out for unexpected reboots.",
      "author": "Retribution EQ #change-log#0000",
      "timestamp": "2024-07-06T16:41:29.295000+00:00"
    },
    {
      "id": "1258612926680531044",
      "content": "```\n- Removed 'Expanded Pet Affinity' (for now, might do something with this concept later)\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-07-05T02:38:25.618000+00:00"
    },
    {
      "id": "1258140468093517824",
      "content": "Pending Patch/Reboot\n\n```\n- Spirit Salve no longer requires line of sight to cast.\n- WP added to Everfrost near Permafrost.\n- Bixie Sword Blade now correctly drops from Bazzt Zzzt\n- PoSky quest \"Test of Body\" now rewards the correct item\n- Stein of Moggok changed back to it's original form. Apoc version maintains its sympathetic proc\n- Eejag no longer spawns within invisible walls\n- Rogue AA Mrylokar's Rigor now procs 25% of the time, up from 2.5%\n- Echo of the Past removed from Feerrott. The Echo inside Fear by the WP now works correctly.\n- Verina Tomb respawn timer lowered to 4 hours with a 30 minute variance\n- Vessel Drozlin respawn timer lowered to 4 hours with a 30 minute variance\n- The Tangrin, and Oracle of K`arnon respawn timer lowered to 4 hours with a 30 minute variance\n- Keeper of Souls no longer double spawns\n- Increased Enchanter AA Phantasmic Reflexes chance to proc (may be adjusted again)\n- WP Added to TD\n- Echo of the Past added to TD\n- Echo of the Past added to FM\n- WP Added to FM\n- Beastlords can now purchase Group Shrink AA\n```",
      "author": "Retribution EQ #change-log#0000",
      "timestamp": "2024-07-03T19:21:02.713000+00:00"
    },
    {
      "id": "1257195892344225883",
      "content": "Upcoming Changes Pending Patch/Reboot:\n\n```\n- Apoc Six Note Blade now WAI\n- Cazic 2.0 loot brought into line with Classic expectations.\n- Marsinger's Gem quest items brought into line with Classic expectations (this is a large change as it was late Luclin quality).\n- Dyllin Starsine's quest drops increased.\n- All Bard Instruments can now be equipped in the Range slot.\n- Monk Sky Weapon Requisite, Brass Knuckles, now drop from Noble and Hand\n- BST AA Frenzied Swipes now correctly lowers the CD of Feral Swipe to 3 seconds for 30 seconds.\n- Disarm now moves the enemies equipment directly into inventory\n- Luclin and PoP Necromancer pet power combinations have been updated based on enhanced classic stats\n- Echo added INSIDE fear next to glyph circle.\n- Nedaria's Landing should not be accessible until GoD.\n- Rune spell cost brought in line to heal cost.\n- Bards can once again use clickies while moving\n- Fear, Mez, Charm, Silence, and Root will now check a players resist EVERY tick as intended\n- Progression NPCs (Faded Memories) now look correct.\n- Tykar Renlin works correctly again.\n\n```\nQuick note:\n\nWhen something is found that is out of era that directly impacts player power, please report it. Assume any OoE item will be brought into line with expectations for availability in whatever expansion it becomes available here. We appreciate your support and understanding as we continue to make Retribution the best it can be.\n\nThank you!",
      "author": "Retribution EQ #change-log#0000",
      "timestamp": "2024-07-01T04:47:38.305000+00:00"
    },
    {
      "id": "1255012117665550440",
      "content": "```\n- Implemented Implied Targeting for pet attack command\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-06-25T04:10:05.849000+00:00"
    },
    {
      "id": "1254511871969726614",
      "content": "```\n6-23-24\n\nVah Shir, Iksar, Beastlords and Berserkers are now available for ALL players regardless of expansion unlock.\nProgress with who you want!\n\nRogue Epic no longer completable in Classic. Congratulations on the feat and thank you for being so agreeable Pointz the Assassin! His Epic will be returned to him as soon as Kunark launches.\n\nSK 51 AA was pointing to the wrong spell file. It was doing too much up front mana regen and was missing its recourse. Fixed on next patch.\n```",
      "author": "Retribution EQ #change-log#0000",
      "timestamp": "2024-06-23T19:02:17.981000+00:00"
    },
    {
      "id": "1254163331300986880",
      "content": "Welcome to Season 1!\n\nWith all the hype, I forgot to actually post this!\n\n```**Seasonal Characters**\n\n - New characters created during a Season will be flagged as 'Seasonal'\n - You may opt-out of seasonal play by using the command #disable_seasonal confirm\n     - YOU MAY NOT GO BACK TO BEING SEASONAL AFTER OPTING OUT. NO EXCEPTIONS.\n\n - Seasonal Characters receive the following bonuses:\n   - (Season 1 Specific) Start with 'First Orb of Retribution', an augment which will grow in power as you participate in the Season\n   - (Season 1 Specific) Start with 'Portable Hole', an upgradable 20-slot bag which you will be able to upgrade as you progress\n   - Greatly increased chance to recieve Apocryphal and Rose-Colored drops\n   - Certain other rewards for defeating progression challenges!\n\n - Seasonal Characters may NOT...\n   - Group with non-Seasonal characters\n   - Trade with non-Seasonal characters\n   - Buy from non-Seasonal traders\n   - Buy ANYTHING from NPC vendors which was sold by players\n   - Pick up items off the ground that were placed by players\n   - Cast spells on non-Seasonal characters.\n   - Be cast upon by non-Seasonal characters\n   - Loot kills that they did not receive XP for\n   - Enter DZs with non-Seasonal characters\n   - Use the Bazaar Buff-bot for standard buffs\n   - May not have more than 6 players in a DZ\n\n* General Changes\n - Everything previously mentioned in the changelog that didn't actually go live due to technical issues.\n - NPCs, except for player Pets, no longer keep items handed by players, they are immediately destroyed.\n - Charmed Pets will hand the item back, while also equipping a copy. The equipped copy is destroyed when the charm breaks.\n - Agents of Retribution renamed to Echo of the Past and will now offer two types of instances; Respawning and non-Respawning\n  - Each instance type is on a different replay timer\n - Dire Charm now works on any mob up to light blue to the caster.\n\n* Bug Fixes\n - The Polymorphist now works correctly again!\n - The Purveyor of Glamour now works correctly again!\n\n* Donation Rewards (Echo of Memory)\n - Merchant added in the Bazaar which sells items for Echo of Memory alt currency.\n  - This alt currency is awarded to players as a 'Thank You' for donations to server costs\n - 20, 30, 40 slot, No Drop bags now available on this merchant in 10 different colors\n - Unattuners added to this merchant\n - No stat Illusion clickies added to this merchant\n - Anything purchased from this merchant may be sold back to them for a small loss```",
      "author": "Retribution EQ #change-log#0000",
      "timestamp": "2024-06-22T19:57:19.410000+00:00"
    },
    {
      "id": "1253065709374930956",
      "content": "Pending reboot/patch etc.\n\n```\nLGuk DZ fixed\nGhoulbane now drops from Shin Lord again\nInfused by rage display error fixed (maybe)\nNote for Janam quest has been fixed in E/W Freeport\nIncorrect item IDs fixed on drop tables for 6th Necro Skullcap quest\nRemaining LoY noob quest NPCs removed.\nSkyshrine key no longer required to go to CS\nDuplicate Chardok agents removed, remaining one fixed.\nZlandicar becomes a dragon again\nChardok, Great Divide, Fungus Grove, and Tenebrous now have Waypoints\nDonation Vendor Added (Will accept EoM for goods soon)\nImproved Damage I and II are now working again on 20+ broken items.\nEnchanter Doppelganger AA works once again, has adjusted stats, and casts a DD according to its level/rank.\nEnchanter AA Deep Sleep now has a 20/40/60/80/100% chance to proc based on rank.\nDruid spells with AC debuffs now scale with level again\n\nNecromancer and Mage Pet Buff lines have been normalized so that benefits scale throughout all levels and not one big chunk at the end. (Focus Death and Burnout Lines). Melee mitigation, Accuracy, STR, Haste, ATK, AC, Strikethrough now incrementally increase with each rank of the spell- addressing many performance questions at different level brackets.\n\nMistmoore, LGuk, Unrest, and CoM now have DZs available.\nThe shared bank will not longer accept plat.\n\nDire Charm now works on any light blue mobs that CAN be charmed and is no longer hard capped by level.\n\nVeksar now unlocks with Luclin\n\nNecro AA Cascade of Decay can now be up the same time as sympathetic strike buffs.\n\nFabled Nagafen can now only be reached by hailing the Sage of Anachronism in the Bazaar\n\n```",
      "author": "Retribution EQ #change-log#0000",
      "timestamp": "2024-06-19T19:15:45.950000+00:00"
    },
    {
      "id": "1247442094872858644",
      "content": "```\n* experimental fix for Artifacts not having persistent ItemIDs\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-06-04T06:49:31.771000+00:00"
    },
    {
      "id": "1246995837700018248",
      "content": "```\nPending Patch:\n\nA number of small but effective changes have been made to allow for a more diverse spread in the three man set up for early progression.\n\nCalliav Line available to MAG, NEC, and BST- Mana cost halved. Casting time halved. Cooldown halved.\nMagician Sol Ro pet items (Pet Power 5) now effect level 29-49 pets in a more noticeable way.\nMagician Planar pet items (Pet Power 10) now effect level 49-60 pets in a more noticeable way.\nNecromancer Epic and Encyclopedia Necrotheurgia added Minion of Hate effect now has a more noticeable effect on Emissary of Thule and Invoke Death\n\nALL MAGE PETS from level 29+ can benefit from Pet Power in a similar way of the custom epic pet does.\nEarth pets will have the same HP and AC as the epic pet while the fire pet will match the epic pets damage (matches at each pet power rank while using the appropriate pet). Water and Air will be between both but keep their unique procs/abilities/casts.\n\nThis reduces the necessity of completing the mage epic and compensates for pet power draughts.\n\nVelious drop Essence of Nature (Tunare) now has the Summoner's Boon focus (Pet Power 15). This change serves to fill the gap in pet power between Kunark and Luclin for Necromancers and Magicians as both can now be effected by Pet Power 15.\n\nBST Pet Spirit of Omakin has been put on Vocarate Water drop table. \nBST Pet Spirit of Zehkes put on Greater Vocaration Water drop table.\nBST Pet Spirit of Khurenz put on Klandicar, Zlandicar, Wuoshi, Velketor, Kelorek, Sontalak, Master of the Guard, Tormax, and Dain \nBST Pet Spirit of Khati Sha stays in Luclin\n\nAll of these four pets have had stats adjusted based on Mage/Necro pet power updates.\n\nBST AA Bite of the Asp RK1 now does 25 damage per tick base, but scales 1 damage per level.\nBST AA Chameleon Strike RK1 now does 25 base damage, but now has RK2 available at 51 for an increased base damage.\n\nMNK AA Imitate Death now has a base 12minute CD with each rank of Hastened Death removing 2 minutes from the CD, max rank resulting in no CD. It now costs 50 Endurance.\n\nChloroblast level requirement changed for RNG/BST to 59.\n\nStacking issues with Warrior AA Infused by Rage fixed.\nBlood of Ssra is now a unique spawn and should no longer double spawn sometimes.\nItems no longer delete from your cursor when zoning\nUrthron's Ultimate Unattuner now works again.\n\nMinotaurs in Steamfont no longer hoard gems.\n\n```",
      "author": "Retribution EQ #change-log#0000",
      "timestamp": "2024-06-03T01:16:15.770000+00:00"
    },
    {
      "id": "1241537691439333516",
      "content": "```\nPending Patch:\n\nEnchanter AA Illusions of Grandeur now gives 200% Crit DoT damage up from 110%\nEnchanter AA Illusions of Grandeur now gives 200% Crit Nuke damage down from 250%\nEnchanter AA Doppelganger has had it's Rk I and II pets adjusted to match the changes made to Rk III that were somehow reverted.\nEnchanter AA Eldritch Rune is now castable on others.\nEnchanter Spell Cajoling Whispers can now be found on Illusionist Jerup in the Bazaar\n\nAll Disciplines that DO NOT have a hastened AA have had their Cooldowns reduced to 15 minutes.\nAll AA that DO NOT have a hastened AA have had their Cooldowns reduced to 15 minutes.\n\nWarrior AA Infused by Rage is now an active AA that applies a permanent buff that can be clicked off by the player.\n\nTearel's Waypoint list is now sorted properly.\n\n```\n\nWe are also bringing live Retribution's Wiki ahead of seasonal launch!\n\nA huge thank you to @ashrem2159 and @Shin Noir (Xackery) \n\nCheck out https://retributioneq.com/ for the link!\n\nPlease let us know if you think anything should be added/edited.",
      "author": "Retribution EQ #change-log#0000",
      "timestamp": "2024-05-18T23:47:32.294000+00:00"
    },
    {
      "id": "1239319403347181588",
      "content": "```\n- Artifacts no longer become no-drop if you zone with them equipped\n- Augments can no longer be dynamic items (Artifacts)\n- Discovery tag on Artifacts now refers to the person who discovered the Legendary variant\n- Artifacts of items with charged activated abilities now have unlimited charges, must be equipped to use, and have a cast time of either 5 seconds or the cast time of the actual spell, whichever is greater\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-05-12T20:52:51.199000+00:00"
    },
    {
      "id": "1239283962421968940",
      "content": "```\n- Fixed Gram Dunnar giving Intricate Wooden Figurine\n- You should no longer be able to complete the Tome of New Beginnings quest multiple times\n- Fixed several Paladin class checks in quests\n- Fixed many Monk class checks across quest scripts\n- Quarm awards GoD flag if you don't have it already somehow\n```",
      "author": "Retribution EQ #change-log#0000",
      "timestamp": "2024-05-12T18:32:01.424000+00:00"
    },
    {
      "id": "1238741761338118144",
      "content": "```\n- Maybe fixed sleeping ogre!\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-05-11T06:37:30.612000+00:00"
    },
    {
      "id": "1235853048107241472",
      "content": "```\n* Re-wrote implied targeting again\n* fixed expanded pet affinity killing some pets\n* combat procs only trigger on damage or healing spells\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-05-03T07:18:47.708000+00:00"
    },
    {
      "id": "1235639942298861588",
      "content": "```\n* Fixed feedback for item XP gain\n* Adjusted item XP rate\n* Combat effects on items can trigger on spell casts\n* Spell Damage and Heal Amount is limited to doubling the initial value of a spell\n* Fixed discovery message spam\n* Reduced spellproc rate for bard songs\n* Artifacts should be explicitly droppable\n* Fixed artifact discovery from itemxp\n* Fixed LoS on combat abilities (@Maze)\n* Ranged attacks can proc bows (@Maze)\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-05-02T17:11:59.324000+00:00"
    },
    {
      "id": "1235081630373122109",
      "content": "```\n* Auto-looting items will no longer place items in the Power Source slot. /autoinventory or use of the auto-inventory area of your inventory screen will continue to do so (for now!)\n* Added feedback for how much item XP you are gaining.\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-05-01T04:13:27.388000+00:00"
    },
    {
      "id": "1235060114998956103",
      "content": "```\n* Leveling up an item will now produce a Discovery event\n* Leveling up an item to Legendary can now produce an Artifact\n* Fixed some logic around discoveries and artifacts\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-05-01T02:47:57.723000+00:00"
    },
    {
      "id": "1234957730041823334",
      "content": "Deploying beta branch for testing. Have fun. Partial changelog below.\n\n```\n* Renamed Latent to 'Enchanted'\n* Renamed Awakened to 'Legendary'\n* Implemented Dynamic Items;\n  - Framework for creating persistent runtime-created items. The ID of these items is not predictable, as they are assigned JIT.  \n  - Notable limitations:\n    - Dynamic Items may not be sold to NPC vendors (forced to 0-value)\n    - Dynamic Items may not be traded to NPCs\n    - Dynamic Items may not dropped on the ground\n* Implemented Artifacts;\n  - Artifacts have a chance to be generated when a player recieves a Legendary item through Loot, Tradeskill, or Quests\n  - Artifacts are Dynamic Items.\n  - Artifacts are named after the player who found them, and can be discovered once per Season (Non-Season is Season 0)\n* Implemented 'Leveling' items in Power Source slot\n  - Items placed in Power Source slot block player from gaining XP normally\n  - They accumulate XP until they reach a sufficient amount based on their stats, and then upgrade to the next tier (ie Normal->Tier1->Tier2)\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-04-30T20:01:07.247000+00:00"
    },
    {
      "id": "1234282565913804800",
      "content": "```\nBazaar NPC overhaul.\n\nBazaar NPCs have been moved to give the Bazaar a more natural feel.\n\nCheck the back stalls for GMs, Spell Vendors, and Tomes.\n```",
      "author": "Retribution EQ #change-log#0000",
      "timestamp": "2024-04-28T23:18:15.575000+00:00"
    },
    {
      "id": "1232891641598050344",
      "content": "```\n- AoR for Yxxta has been moved.\n- Enchanter pets over level 55 have had their damage increased.\n- Necromancer AA Death Bloom is now available at 51... be careful.\n- Classic Rogue poisons *actually* have 50 charges now.\n- Rathe Council banishes now instance aware.\n- Backstab Damage has been completely removed from weapons. This means that backstab will now use weapon damage as backstab damage. (This is a BUFF to backstab damage).\n- Monks starting AA changed from Stonewall to Rk I of Techniques of Master Wu\n- All pet classes now start with Pet Discipline\n- Tendrils of Fire now hits for 450 and has a -450 resist mod\n- Vrabbit Xloren is now instance aware when he ports you\n- Ranger AA Trickshot Rk I now starts at 5% up from 2% and continues to increase by 2% per rank\n- ALL RC and Apoc weapons now have the correct +10% and +20% proc mods they were meant to\n- There is now only one Vacto\n```",
      "author": "Retribution EQ #change-log#0000",
      "timestamp": "2024-04-25T03:11:13.376000+00:00"
    },
    {
      "id": "1232318545015345263",
      "content": "```\nBugfixes:\n- Fixed Saryrn and Quarm (GoD and Fabled Naggy) flags\n- Ancient Cragbeast Matriarch in Txevu no longer causes client disconnects\n- Several misc bugfixes\n- Muzzle of Mardu is no longer usable by players\n\nNew Features:\n- Bazaar Portal will now return you to the place where you last used it if you use it while inside the Bazaar\n- Items may now be Parceled\n- Apocrypha in the Bazaar now offers an option to enhance the upgrade rate of all drops in the world for 4 hours. While in effect, this buff will cause any mob you kill to have an additional chance to upgrade each of its drops from normal to Rose Colored or from Rose Colored to Apocryphal. (This is a world-wide buff which affects all players while it is in effect).\n```",
      "author": "Retribution EQ #change-log#0000",
      "timestamp": "2024-04-23T13:13:56.503000+00:00"
    },
    {
      "id": "1232223984561553438",
      "content": "PENDING REBOOT\n\n```\nBugfixes:\n- Fixed Saryrn and Quarm (GoD and Fabled Naggy) flags\n- Ancient Cragbeast Matriarch in Txevu no longer causes client disconnects\n- Several misc bugfixes\n- Pet bag no longer endlessly upgrades items\n- AA are instant-cast again\n- All versions of Intricate Wooden Figurine which you are eligible will be awarded.\n\nNew Features:\n- Bazaar Portal will now return you to the place where you last used it if you use it while inside the Bazaar\n- Items may now be Parceled\n- Apocrypha in the Bazaar now offers an option to enhance the upgrade rate of all drops in the world for 4 hours. While in effect, this buff will cause any mob you kill to have an additional chance to upgrade each of its drops from normal to Rose Colored or from Rose Colored to Apocryphal.\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-04-23T06:58:11.534000+00:00"
    },
    {
      "id": "1229610384810577930",
      "content": "```\n- THJ is now officially running entirely off of Retribution's database.\n- More iteration to come in terms of scripts and content!\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-04-16T01:52:40.795000+00:00"
    },
    {
      "id": "1223671331258892388",
      "content": "Pending Reboot\\Luck in getting a fresh zs\n```\n- Buff stacking adjusted\n  - Short Buffs (Songs) and Long Buffs no longer have stacking conflicts between categories.\n  - Detrimental and Beneficial spells no longer have stacking conflicts between categories.\n  - The EFFECTS of the buffs may not stack (mostly between Detrimental and Beneficial), but the buff icons themselves won't block or overwrite. This mostly applies to certain effects like haste\\slow.\n- Casting skills can only increase from spells cast from spellgems\n- Bard Songs will no longer fade just because they ran out of Rune capacity\n- Re-introduced Extended Pet Affinity.\n  - Now applies to instant-duration (ie heals, cures) as well. Pets need a little bit of love in terms of survivability.\n- Instrument modifiers no longer scale effects inappropriately.\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-03-30T16:33:00.086000+00:00"
    },
    {
      "id": "1223653123919184135",
      "content": "* Forgot to add earlier\n```\n- Faction checks now use the best modifier amongst your unlocked classes\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-03-30T15:20:39.118000+00:00"
    },
    {
      "id": "1223341400129540257",
      "content": "* Pending Reboot\n```\n- Focus effects now work\n- Spell Damage\\Heal Amount is limited so that it will no more than double the base effect of a spell\n- Sympathetic procs are now scaled based off of the cast time and mana cost of the spell which triggered them.\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-03-29T18:41:58.375000+00:00"
    },
    {
      "id": "1223294443701014601",
      "content": "```\n- Corrected /who formatting\n- Out-of-Range mobs no longer show up as 'Mob' on map.\n  - This is to correct the memory leak in the client during long play sessions\n- Cast time is now displayed on spell inspect window\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-03-29T15:35:23.090000+00:00"
    },
    {
      "id": "1222749347314405427",
      "content": "```\nPending reboot\n\n- Emperor SSRA is now a Unique Spawn\n- Monk FoS AA is now H2H only\n- Bard song cap to correctly mimic Ret\n```",
      "author": "apor1a",
      "timestamp": "2024-03-28T03:29:21.984000+00:00"
    },
    {
      "id": "1220215612547141632",
      "content": "```\n- Sympathetic Procs no longer trigger for anything except spell casts (from Gems)\n- Sympathetic Procs no longer trigger for bard songs\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-03-21T03:41:12.541000+00:00"
    },
    {
      "id": "1218331890960826460",
      "content": "```\n- Focus Effects should now work\n- Monks should be able to DW empty-handed\n- Monk epic should now affect base stats of empty hand h2h attacks\n- Group Buffs should work on charmed pets\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-03-15T22:55:58.317000+00:00"
    },
    {
      "id": "1218097434379419658",
      "content": "```\n- Fixed Lavastorm zone lines - you will need to delete lavastorm.eqg from your game directory manually.\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-03-15T07:24:19.512000+00:00"
    },
    {
      "id": "1218033525576433674",
      "content": "```\n- AA cast time is 0 again\n- Adventurer's pack increased to 18 slots (will go back to 12 on next server wipe)\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-03-15T03:10:22.466000+00:00"
    },
    {
      "id": "1218026683962101780",
      "content": "```\n- Content DB is now more closely aligned with Retribution\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-03-15T02:43:11.298000+00:00"
    },
    {
      "id": "1216073319342673990",
      "content": "```\n- Delay on debuffs on target applied removed\n- Pet spell messages should be working now\n- Added pet resist and DoT messages\n- Applying a charm spell no longer strips your debuffs\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-03-09T17:21:12.881000+00:00"
    },
    {
      "id": "1215744343210459296",
      "content": "``` - Deleted this door.```",
      "author": "catapultam_habeo",
      "timestamp": "2024-03-08T19:33:58.859000+00:00"
    },
    {
      "id": "1215744114260443226",
      "content": "```\n- Slightly increased base XP rate\n- Greatly increased AAXP rate\n- Increased modifiers for Red\\Yellow\n- Decreased modifiers for Blue\\LBlue\\Green\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-03-08T19:33:04.273000+00:00"
    },
    {
      "id": "1215085856986103918",
      "content": "```\n- Progression flags can be acquired from any version of Naggy\\Vox\\Phinny```",
      "author": "catapultam_habeo",
      "timestamp": "2024-03-06T23:57:23.509000+00:00"
    },
    {
      "id": "1215020038755713165",
      "content": "```\n- Added Pet Discipline to starting AA for Mages, Necromancers, Beastlord, Enchanter, Shaman\n- Added Advanced Pet Discipline to starting AA for Mages & Necromancers\n- Starting AA are now properly reapplied on zone if you are missing any\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-03-06T19:35:51.220000+00:00"
    },
    {
      "id": "1215002506032320612",
      "content": "```\n- Non-Weapon Instruments that can be equipped in Primary or Secondary can now be equipped in range and ammo slots (Ammo currently does nothing).\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-03-06T18:26:11.093000+00:00"
    },
    {
      "id": "1214760643895238697",
      "content": "```\n- Added /mapfilter to map (Thanks, @Voidless)\n- Added click-to-target on map for mobs who you can detect\n\n- Updated patcher to recognize LAA eqgame.exe (may ned to manually download new patcher at https://github.com/The-Heroes-Journey-EQEMU/eqemupatcher/releases/download/1.0.6.49/heroesjourneyeq.exe)\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-03-06T02:25:06.666000+00:00"
    },
    {
      "id": "1214387592389328927",
      "content": "```\n- Mixed Latent\\Awakened\\Untagged quest turn ins now REALLY work\n- You can no longer zone into DoN or OoW zones\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-03-05T01:42:44.256000+00:00"
    },
    {
      "id": "1213799949716819978",
      "content": "```\n- Added Latent\\Awakened bags (next reboot)\n\n- SolB instances are now available.\n- Permafrost instances are now available.\n- Kedge instances are now available\n\n- Instancing on The Heroes' Journey:\n  - Seek out 'A Servant of the Journey' outside, near, or inside raid zones.\n  - You will be offered up to two types of instances; Challenge or Opportunity\n  - All instances are limited to 6 characters and last 24hours.\n  - Challenge instances are available to anyone who have either\n     1) Not completed the progression flag associated with this zone\n     2) Not exceeded the recommended maximum level for this zone\n  - Challenge instances are non-respawning, objective-based tasks, and will reward both 'Accolades of Heroism' and progression flags.\n  - If an ineligible person joins a Challenge instance, it will immediately fail.\n  - Challenge instances lock immediately upon starting, and have a 20 hour lockout upon completion.\n  - Accolades of Heroism will be used to buy equipment in the Bazaar, and will be fully tradable.\n  - Opportunity instances have a 20 hour lockout upon request.\n  - Opportunity instances are direct copies of the relevant zone, with full repops, etc.\n  - Opportunity instances are available to anyone who both meets the level minimum for the instance and has completed the Challenge mode on any character.\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-03-03T10:47:39.325000+00:00"
    },
    {
      "id": "1213776104800653393",
      "content": "```\n- Augments are now All\\All\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-03-03T09:12:54.254000+00:00"
    },
    {
      "id": "1213692673970675772",
      "content": "```\n- Increased the rate at which upgraded versions of items will drop\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-03-03T03:41:22.794000+00:00"
    },
    {
      "id": "1213344196212031572",
      "content": "```\n- Tradeskills can now be done with any mix of untagged\\latent\\awakened components```",
      "author": "catapultam_habeo",
      "timestamp": "2024-03-02T04:36:39.222000+00:00"
    },
    {
      "id": "1213018140976357377",
      "content": "```\n- Characters in the Bazaar are exempt from IP box limits\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-03-01T07:01:01.596000+00:00"
    },
    {
      "id": "1212927236416475156",
      "content": "```\n- Added a large number of waypoints in Classic\n- Added a large number of waypoints in Kunark\n- Adjusted respawn frequency of all mobs\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-03-01T00:59:48.260000+00:00"
    },
    {
      "id": "1212901460459659356",
      "content": "```\n- Tradeskills will always return (Awakened) items.\n` Removed (Latent) tag from normal-quality gear. Henceforth 'untagged' tier.\n- Renamed (Potent) tag to (Latent)\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-02-29T23:17:22.793000+00:00"
    },
    {
      "id": "1212887837637091349",
      "content": "```\n- Added MIT and AVG stats to inventory; These show ACTUAL mitigation and avoidance AC after softcap are taken into account\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-02-29T22:23:14.859000+00:00"
    },
    {
      "id": "1212880650231750686",
      "content": "```\n- Improved merchant filtering (patch needed)\n- All activated are now instant-cast (patch + reboot)\n- Augments no longer require distillers to remove (reboot)\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-02-29T21:54:41.248000+00:00"
    },
    {
      "id": "1212842973805420665",
      "content": "```\n- Soulbinders will also offer gates to bazaar and bind\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-02-29T19:24:58.488000+00:00"
    },
    {
      "id": "1212822578775855125",
      "content": "```\n- reverted 'humans look like monk thing' for now\n- restored original UI\n- custom UI can be loaded with /loadskin thj_ui\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-02-29T18:03:55.934000+00:00"
    },
    {
      "id": "1212579951899836436",
      "content": "```\n- Switching base class should no longer be required for any class combinations\n- Please report any problems with spellcasting as high-priority bugs\n- Humans and Iksar with Monk in their composition will look like Monks\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-02-29T01:59:49.179000+00:00"
    },
    {
      "id": "1212500743593001070",
      "content": "```\n(Patch Required)\n- Merchantlist filter now properly accounts for your classes\n- Levels displayed on spell scrolls is no longer wonky for shared spells\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-02-28T20:45:04.447000+00:00"
    },
    {
      "id": "1212457069127401575",
      "content": "* Pending Reboot\n```\n- Added \nRULE_INT(Spells, DOTsScaleWithSpellDmgPerTickPercent, 0, \"Allow SpellDmg stat to affect DoT spells but by a per tick\")\nRULE_INT(Spells, HOTsScaleWithHealAmtPerTickPercent, 0, \"Allow HealAmt stat to affect HoT spells but by a per tick\")\nRULE_INT(Spells, PetsScaleWithOwnerPercent, 0, \"Allow Pet spells to use the owners stats when casting spells by a percent\")\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-02-28T17:51:31.643000+00:00"
    },
    {
      "id": "1212296544359817266",
      "content": "```\n- Fixed Lavastorm (repatch needed)\n- Fixed Patcher weirdness\n- Abysmal Sea is accessible\n- Added LoY, DoN, OoW, GoD zones to progression lockouts\n- Any tag (Latent, Potent, or Awakened) can be used for quest turn-ins\n- All AA are instant-cast.\n- Fading Memories now uses mana\n- Added Phinigel Autropos to Kunark unlock targets\n- Attempting to zone to a disallowed zone will drop you in the nexus.\n- Fixed Several bugs\n- Fixed Neriak waypoint in the wrong location. Cleared all waypoints.\n- Fixed pet buffs suspension after zoning\n- Fixed detrimental spells suspending\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-02-28T07:13:39.556000+00:00"
    },
    {
      "id": "1211944847376777226",
      "content": "```\n- Disciplines should now no longer cause crash on zone\n- Implied targeting should be much improved (corpses, procs)\n- Pet buffs & heals no longer force change target to pet\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-02-27T07:56:08.461000+00:00"
    },
    {
      "id": "1211454275004141629",
      "content": "```\n- Re-enabled corpses\n- Disabled quests from checking corpses for items (lag fix)\n- You can now zone out of the Bazaar using a means other than the zone line\n   - Expected behavior here is that zone lines take you to the source of your portal. If you don't have one somehow, you'll go to the nexus if you have luclin unlocked or your bind point otherwise.\n   - Leaving the zone by any means other than a zone line will clear your saved portal source location\n- Corrected zoning into Highpass (New version for now, will work on legacy version again later)\n- Implemented Faded Writ quest\n- Removed all Fabled mobs from spawn lists\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-02-25T23:26:46.893000+00:00"
    },
    {
      "id": "1210879145433628741",
      "content": "```\n- Disabled corpses for now to work around a crash bug\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-02-24T09:21:25.318000+00:00"
    },
    {
      "id": "1210783101270102156",
      "content": "```\n- Hello!\n- Fixed the No-XP bug\n- Fixed base mana regen\n- Fixed crash on interacting with GM\n```",
      "author": "catapultam_habeo",
      "timestamp": "2024-02-24T02:59:46.605000+00:00"
    }
  ],
  "last_updated": "2025-04-03T19:46:42.210404+00:00",
  "version": 2
}